using Microsoft.EntityFrameworkCore.Metadata.Builders;
using Microsoft.EntityFrameworkCore;
using PreparationForITExam.Infrastructure.Data.Entities;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace PreparationForITExam.Infrastructure.Data.Configurations
{
    public class SchoolConfiguration : IEntityTypeConfiguration<School>
    {
        public void Configure(EntityTypeBuilder<School> builder)
        {
            builder.HasData(new List<School>
            {
               new School {
                    Id =1,
                    Name ="Профилираната гимназия за изобразителни изкуства \"Професор Николай Райнов\"",
                    NormalizedName ="профилираната гимназия за изобразителни изкуства \"професор николай райнов\"",
                    City = "София"
                },

                new School {
                    Id =2,
                    Name ="Трето Средно Общообразователно Училище \"Марин Дринов\"",
                    NormalizedName ="трето средно общообразователно училище \"марин дринов\"",
                    City = "София"
                },

                new School {
                    Id =3,
                    Name ="118 Средно Общообразователно Училище \"Академик Людмил Стоянов\"",
                    NormalizedName ="118 средно общообразователно училище \"академик людмил стоянов\"",
                    City = "София"
                },

                new School {
                    Id =4,
                    Name ="192 СОУ \"Христо Ботев\"",
                    NormalizedName ="192 соу \"христо ботев\"",
                    City = "София"
                },

                new School {
                    Id =5,
                    Name ="81 Средно Общообразователно Училище \"Виктор Юго\"",
                    NormalizedName ="81 средно общообразователно училище \"виктор юго\"",
                    City = "София"
                },

                new School {
                    Id =6,
                    Name ="Англо-американско училище в София",
                    NormalizedName ="англо-американско училище в софия",
                    City = "София"
                },

                new School {
                    Id =7,
                    Name ="Руски лицей \"Архиепископ Серафим\"",
                    NormalizedName ="руски лицей \"архиепископ серафим\"",
                    City = "София"
                },

                new School {
                    Id =8,
                    Name ="Средно Художествено Училище За Приложни Изкуства \"Свети Лука\"",
                    NormalizedName ="средно художествено училище за приложни изкуства \"свети лука\"",
                    City = "София"
                },

                new School {
                    Id =9,
                    Name ="Частен Английска Гимназия \"Евростандарт\"",
                    NormalizedName ="частен английска гимназия \"евростандарт\"",
                    City = "София"
                },

                new School {
                    Id =10,
                    Name ="Технологично Училище Електронни Системи към Технически Университет - София",
                    NormalizedName ="технологично училище електронни системи към технически университет - софия",
                    City = "София"
                },

                new School {
                    Id =11,
                    Name ="Национална Гимназия За Древни Езици и Култури \"Константин Кирил Философ\"",
                    NormalizedName ="национална гимназия за древни езици и култури \"константин кирил философ\"",
                    City = "София"
                },

                new School {
                    Id =12,
                    Name ="Първа Английска Езикова Гимназия",
                    NormalizedName ="първа английска езикова гимназия",
                    City = "София"
                },

                new School {
                    Id =13,
                    Name ="Частна Професионална Гимназия по Икономика, Туризъм и Информатика \"Булпрогрес\"",
                    NormalizedName ="частна професионална гимназия по икономика, туризъм и информатика \"булпрогрес\"",
                    City = "София"
                },

                new School {
                    Id =14,
                    Name ="78 Средно Общообразователно Училище \"Христо Смирненски\"",
                    NormalizedName ="78 средно общообразователно училище \"христо смирненски\"",
                    City = "София"
                },

                new School {
                    Id =15,
                    Name ="Частно Средно Общообразователно Училище \"Евроучилище Ровел\"",
                    NormalizedName ="частно средно общообразователно училище \"евроучилище ровел\"",
                    City = "София"
                },

                new School {
                    Id =16,
                    Name ="Частна Профилирана Гимназия \"Дружба\"",
                    NormalizedName ="частна профилирана гимназия \"дружба\"",
                    City = "София"
                },

                new School {
                    Id =17,
                    Name ="26 Средно Общообразователно Училище \"Йордан Йовков\"",
                    NormalizedName ="26 средно общообразователно училище \"йордан йовков\"",
                    City = "София"
                },

                new School {
                    Id =18,
                    Name ="Частно Профилирано Средно Общообразователно Училище \"Свети Наум\"",
                    NormalizedName ="частно профилирано средно общообразователно училище \"свети наум\"",
                    City = "София"
                },

                new School {
                    Id =19,
                    Name ="Частно Средно Общообразователно Училище \"Рьорих\"",
                    NormalizedName ="частно средно общообразователно училище \"рьорих\"",
                    City = "София"
                },

                new School {
                    Id =20,
                    Name ="Частно Средно Общообразователно Училище \"Дрита\"",
                    NormalizedName ="частно средно общообразователно училище \"дрита\"",
                    City = "София"
                },

                new School {
                    Id =21,
                    Name ="Средно Специално Училище За Деца с Увреден Слух \"Проф. Д-Р Дечо Денев\"",
                    NormalizedName ="средно специално училище за деца с увреден слух \"проф. д-р дечо денев\"",
                    City = "София"
                },

                new School {
                    Id =22,
                    Name ="74 Средно Общообразователно Училище \"Гоце Делчев\"",
                    NormalizedName ="74 средно общообразователно училище \"гоце делчев\"",
                    City = "София"
                },

                new School {
                    Id =23,
                    Name ="13 Средно Общообразователно Училище \"Св.Св.Кирил и Методий\"",
                    NormalizedName ="13 средно общообразователно училище \"св.св.кирил и методий\"",
                    City = "София"
                },

                new School {
                    Id =24,
                    Name ="30 Средно Общообразователно Училище \"Братя Миладинови\"",
                    NormalizedName ="30 средно общообразователно училище \"братя миладинови\"",
                    City = "София"
                },

                new School {
                    Id =25,
                    Name ="32 СОУ с Изучаване на Чужди Езици \"Свети Климент Охридски\"",
                    NormalizedName ="32 соу с изучаване на чужди езици \"свети климент охридски\"",
                    City = "София"
                },

                new School {
                    Id =26,
                    Name ="134 Средно Общообразователно Училище \"Димчо Дебелянов\"",
                    NormalizedName ="134 средно общообразователно училище \"димчо дебелянов\"",
                    City = "София"
                },

                new School {
                    Id =27,
                    Name ="Национална Професионална Гимназия по Прецизна Техника и Оптика \"М.В.Ломоносов\"",
                    NormalizedName ="национална професионална гимназия по прецизна техника и оптика \"м.в.ломоносов\"",
                    City = "София"
                },

                new School {
                    Id =28,
                    Name ="Професионална Гимназия по Подемна, Строителна и Транспортна Техника",
                    NormalizedName ="професионална гимназия по подемна, строителна и транспортна техника",
                    City = "София"
                },

                new School {
                    Id =29,
                    Name ="Частна Профилирана Гимназия \"Езиков Свят\"",
                    NormalizedName ="частна профилирана гимназия \"езиков свят\"",
                    City = "София"
                },

                new School {
                    Id =30,
                    Name ="105 Средно Общообразователно Училище \"Атанас Далчев\"",
                    NormalizedName ="105 средно общообразователно училище \"атанас далчев\"",
                    City = "София"
                },

                new School {
                    Id =31,
                    Name ="119 Средно Общообазователно Училище \"Академик Михаил Арнаудов\"",
                    NormalizedName ="119 средно общообазователно училище \"академик михаил арнаудов\"",
                    City = "София"
                },

                new School {
                    Id =32,
                    Name ="Софийска Професионална Гимназия по Електроника \"Джон Атанасов\"",
                    NormalizedName ="софийска професионална гимназия по електроника \"джон атанасов\"",
                    City = "София"
                },

                new School {
                    Id =33,
                    Name ="Частна Езикова Гимназия \"Проф. Иван Апостолов\"",
                    NormalizedName ="частна езикова гимназия \"проф. иван апостолов\"",
                    City = "София"
                },

                new School {
                    Id =34,
                    Name ="Частна Професионална Гимназия по Мениджмънт и Бизнес Администрация \"Хелиос 2000\"",
                    NormalizedName ="частна професионална гимназия по мениджмънт и бизнес администрация \"хелиос 2000\"",
                    City = "София"
                },

                new School {
                    Id =35,
                    Name ="113 Средно Общообразователно Училище \"Сава Филаретов\"",
                    NormalizedName ="113 средно общообразователно училище \"сава филаретов\"",
                    City = "София"
                },

                new School {
                    Id =36,
                    Name ="Втора Английска Езикова Гимназия \"Томас Джеферсън\"",
                    NormalizedName ="втора английска езикова гимназия \"томас джеферсън\"",
                    City = "София"
                },

                new School {
                    Id =37,
                    Name ="Професионална Гимназия по Транспорт и Енергетика \"Хенри Форд\"",
                    NormalizedName ="професионална гимназия по транспорт и енергетика \"хенри форд\"",
                    City = "София"
                },

                new School {
                    Id =38,
                    Name ="Професионална Гимназия \"А. С. Попов\"",
                    NormalizedName ="професионална гимназия \"а. с. попов\"",
                    City = "София"
                },

                new School {
                    Id =39,
                    Name ="138 Средно Общообразователно Училище \"Никола Беловеждов\"",
                    NormalizedName ="138 средно общообразователно училище \"никола беловеждов\"",
                    City = "София"
                },

                new School {
                    Id =40,
                    Name ="Професионална Гимназия по Транспорт",
                    NormalizedName ="професионална гимназия по транспорт",
                    City = "София"
                },

                new School {
                    Id =41,
                    Name ="Софийска Гимназия по Хлебни и Сладкарски Технологии",
                    NormalizedName ="софийска гимназия по хлебни и сладкарски технологии",
                    City = "София"
                },

                new School {
                    Id =42,
                    Name ="Частна Професионална Гимназия \"Братя Вълчеви\"",
                    NormalizedName ="частна професионална гимназия \"братя вълчеви\"",
                    City = "София"
                },

                new School {
                    Id =43,
                    Name ="19 Средно Общобразователно Училище \"Елин Пелин\"",
                    NormalizedName ="19 средно общобразователно училище \"елин пелин\"",
                    City = "София"
                },

                new School {
                    Id =44,
                    Name ="51-во Средно Общообразователно Училище \"Елисавета Багряна\"",
                    NormalizedName ="51-во средно общообразователно училище \"елисавета багряна\"",
                    City = "София"
                },

                new School {
                    Id =45,
                    Name ="132-ро Средно Общообразователно Училище \"Ваня Войнова\"",
                    NormalizedName ="132-ро средно общообразователно училище \"ваня войнова\"",
                    City = "София"
                },

                new School {
                    Id =46,
                    Name ="Частно Езиково Средно Общообразователно Училище \"Дорис Тенеди\"",
                    NormalizedName ="частно езиково средно общообразователно училище \"дорис тенеди\"",
                    City = "София"
                },

                new School {
                    Id =47,
                    Name ="Частна Математическа Гимназия \"Евклид\"",
                    NormalizedName ="частна математическа гимназия \"евклид\"",
                    City = "София"
                },

                new School {
                    Id =48,
                    Name ="85 Средно Общообразователно Училище \"Отец Паисий\"",
                    NormalizedName ="85 средно общообразователно училище \"отец паисий\"",
                    City = "София"
                },

                new School {
                    Id =49,
                    Name ="21-во Средно Общообразователно Училище \"Христо Ботев\"",
                    NormalizedName ="21-во средно общообразователно училище \"христо ботев\"",
                    City = "София"
                },

                new School {
                    Id =50,
                    Name ="35 Средно Общообразователно Училище \"Добри Войников\"",
                    NormalizedName ="35 средно общообразователно училище \"добри войников\"",
                    City = "София"
                },
              new School {
                    Id =51,
                    Name ="Национална Природо-Математическа Гимназия \"Акад. Л. Чакалов\"",
                    NormalizedName ="национална природо-математическа гимназия \"акад. л. чакалов\"",
                    City = "София"
                },

                new School {
                    Id =52,
                    Name ="Професионална Гимназия по Облекло \"Княгиня Мария Луиза\"",
                    NormalizedName ="професионална гимназия по облекло \"княгиня мария луиза\"",
                    City = "София"
                },

                new School {
                    Id =53,
                    Name ="Софийска Гимназия по Строителство, Архитектура и Геодезия \"Христо Ботев\"",
                    NormalizedName ="софийска гимназия по строителство, архитектура и геодезия \"христо ботев\"",
                    City = "София"
                },

                new School {
                    Id =54,
                    Name ="Национална Финансово - Стопанска Гимназия",
                    NormalizedName ="национална финансово - стопанска гимназия",
                    City = "София"
                },

                new School {
                    Id =55,
                    Name ="Частна Професионална Гимназия \"Банкер\"",
                    NormalizedName ="частна професионална гимназия \"банкер\"",
                    City = "София"
                },

                new School {
                    Id =56,
                    Name ="Софийска Духовна Семинария \"Св. Иван Рилски\"",
                    NormalizedName ="софийска духовна семинария \"св. иван рилски\"",
                    City = "София"
                },

                new School {
                    Id =57,
                    Name ="Частно училище за танцово изкуство \"Галина Сергеевна Уланова\"",
                    NormalizedName ="частно училище за танцово изкуство \"галина сергеевна уланова\"",
                    City = "София"
                },

                new School {
                    Id =58,
                    Name ="40 Средно Общообразователно Училище \"Луи Пастьор\"",
                    NormalizedName ="40 средно общообразователно училище \"луи пастьор\"",
                    City = "София"
                },

                new School {
                    Id =59,
                    Name ="56-то Средно Общообразователно Училище \"Проф. Константин Иречек\"",
                    NormalizedName ="56-то средно общообразователно училище \"проф. константин иречек\"",
                    City = "София"
                },

                new School {
                    Id =60,
                    Name ="79 Средно Общообразователно Училище \"Индира Ганди\"",
                    NormalizedName ="79 средно общообразователно училище \"индира ганди\"",
                    City = "София"
                },

                new School {
                    Id =61,
                    Name ="90 Средно Общообразователно Училище \"Генерал Хосе Де Сан Мартин\"",
                    NormalizedName ="90 средно общообразователно училище \"генерал хосе де сан мартин\"",
                    City = "София"
                },

                new School {
                    Id =62,
                    Name ="96 СОУ с изучаване на чужди езици \"Лев Николаевич Толстой\"",
                    NormalizedName ="96 соу с изучаване на чужди езици \"лев николаевич толстой\"",
                    City = "София"
                },

                new School {
                    Id =63,
                    Name ="97 Средно Общообразователно Училище \"Братя Миладинови\"",
                    NormalizedName ="97 средно общообразователно училище \"братя миладинови\"",
                    City = "София"
                },

                new School {
                    Id =64,
                    Name ="137 Средно Общообразователно Училище \"Ангел Кънчев\"",
                    NormalizedName ="137 средно общообразователно училище \"ангел кънчев\"",
                    City = "София"
                },

                new School {
                    Id =65,
                    Name ="Немска Гимназия \"Ерих Кестнер\"",
                    NormalizedName ="немска гимназия \"ерих кестнер\"",
                    City = "София"
                },

                new School {
                    Id =66,
                    Name ="Частно Средно Училище \"Петко Рачов Славейков\"",
                    NormalizedName ="частно средно училище \"петко рачов славейков\"",
                    City = "София"
                },

                new School {
                    Id =67,
                    Name ="39 Средно Общообразователно Училище \"Петър Динеков\"",
                    NormalizedName ="39 средно общообразователно училище \"петър динеков\"",
                    City = "София"
                },

                new School {
                    Id =68,
                    Name ="128 Средно Общообразователно Училище \"Алберт Айнщайн\"",
                    NormalizedName ="128 средно общообразователно училище \"алберт айнщайн\"",
                    City = "София"
                },

                new School {
                    Id =69,
                    Name ="131 СОУ \"Климент Аркадиевич Тимирязев\"",
                    NormalizedName ="131 соу \"климент аркадиевич тимирязев\"",
                    City = "София"
                },

                new School {
                    Id =70,
                    Name ="144 Средно Общообразователно Училище \"Народни Будители\"",
                    NormalizedName ="144 средно общообразователно училище \"народни будители\"",
                    City = "София"
                },

                new School {
                    Id =71,
                    Name ="145 Средно Общообразователно Училище \"Симеон Радев\"",
                    NormalizedName ="145 средно общообразователно училище \"симеон радев\"",
                    City = "София"
                },

                new School {
                    Id =72,
                    Name ="Спортно Училище \"Ген. Владимир Стойчев\"",
                    NormalizedName ="спортно училище \"ген. владимир стойчев\"",
                    City = "София"
                },

                new School {
                    Id =73,
                    Name ="Частна Профилирана Гимназия с Чуждоезиково Обучение \"Меридиан 22\"",
                    NormalizedName ="частна профилирана гимназия с чуждоезиково обучение \"меридиан 22\"",
                    City = "София"
                },

                new School {
                    Id =74,
                    Name ="Частно Средно Общообразователно Училище с Ранно Чуждоезиково Обучение Еспа",
                    NormalizedName ="частно средно общообразователно училище с ранно чуждоезиково обучение еспа",
                    City = "София"
                },

                new School {
                    Id =75,
                    Name ="Професионална Гимназия \"Интербизнес\"",
                    NormalizedName ="професионална гимназия \"интербизнес\"",
                    City = "София"
                },

                new School {
                    Id =76,
                    Name ="101 Средно Общообразователно Училище \"Бачо Киро\"",
                    NormalizedName ="101 средно общообразователно училище \"бачо киро\"",
                    City = "София"
                },

                new School {
                    Id =77,
                    Name ="153-та Профилирана Гимназия \"Неофит Рилски\"",
                    NormalizedName ="153-та профилирана гимназия \"неофит рилски\"",
                    City = "София"
                },

                new School {
                    Id =78,
                    Name ="Частна Професионална Гимназия по Туризъм \"Свети Мина\"",
                    NormalizedName ="частна професионална гимназия по туризъм \"свети мина\"",
                    City = "София"
                },

                new School {
                    Id =79,
                    Name ="170 Средно Общообразователно Училище \"Васил Левски\" кв.Курило",
                    NormalizedName ="170 средно общообразователно училище \"васил левски\" кв.курило",
                    City = "София"
                },

                new School {
                    Id =80,
                    Name ="Първо Средно Общообразователно Училище \"Пенчо П. Славейков\"",
                    NormalizedName ="първо средно общообразователно училище \"пенчо п. славейков\"",
                    City = "София"
                },

                new School {
                    Id =81,
                    Name ="164та Гимназия с преподаване на Испански език \"Мигел Де Сервантес\"",
                    NormalizedName ="164та гимназия с преподаване на испански език \"мигел де сервантес\"",
                    City = "София"
                },

                new School {
                    Id =82,
                    Name ="Софийска Математическа Гимназия \"Паисий Хилендарски\"",
                    NormalizedName ="софийска математическа гимназия \"паисий хилендарски\"",
                    City = "София"
                },

                new School {
                    Id =83,
                    Name ="Професионална Гимназия по Механоелектротехника \"Н.Й.Вапцаров\"",
                    NormalizedName ="професионална гимназия по механоелектротехника \"н.й.вапцаров\"",
                    City = "София"
                },

                new School {
                    Id =84,
                    Name ="Софийска Професионална Гимназия по Туризъм",
                    NormalizedName ="софийска професионална гимназия по туризъм",
                    City = "София"
                },

                new School {
                    Id =85,
                    Name ="Частно Средно Общообразователно Училище \"Увекинд\"",
                    NormalizedName ="частно средно общообразователно училище \"увекинд\"",
                    City = "София"
                },

                new School {
                    Id =86,
                    Name ="Първа Частна Английска Гимназия \"Уилям Шекспир\"",
                    NormalizedName ="първа частна английска гимназия \"уилям шекспир\"",
                    City = "София"
                },

                new School {
                    Id =87,
                    Name ="66-то СОУ \"Филип Станиславов\"",
                    NormalizedName ="66-то соу \"филип станиславов\"",
                    City = "София"
                },

                new School {
                    Id =88,
                    Name ="88 Средно Общообразователно Училище \"Димитър Попниколов\"",
                    NormalizedName ="88 средно общообразователно училище \"димитър попниколов\"",
                    City = "София"
                },

                new School {
                    Id =89,
                    Name ="Национално Средно Общообразователно Училище \"София\"",
                    NormalizedName ="национално средно общообразователно училище \"софия\"",
                    City = "София"
                },

                new School {
                    Id =90,
                    Name ="Частна Профилирана Езикова Гимназия \"Д-Р Мария Монтесори\"",
                    NormalizedName ="частна профилирана езикова гимназия \"д-р мария монтесори\"",
                    City = "София"
                },

                new School {
                    Id =91,
                    Name ="Частно Средно Общообразователно Училище \"Евростар\"",
                    NormalizedName ="частно средно общообразователно училище \"евростар\"",
                    City = "София"
                },

                new School {
                    Id =92,
                    Name ="95 СОУ \"Проф. Иван Шишманов\"",
                    NormalizedName ="95 соу \"проф. иван шишманов\"",
                    City = "София"
                },

                new School {
                    Id =93,
                    Name ="130 Средно Общообразователно Училище \"Стефан Караджа\"",
                    NormalizedName ="130 средно общообразователно училище \"стефан караджа\"",
                    City = "София"
                },

                new School {
                    Id =94,
                    Name ="166 Спортно Училище \"Васил Левски\"",
                    NormalizedName ="166 спортно училище \"васил левски\"",
                    City = "София"
                },

                new School {
                    Id =95,
                    Name ="14 Средно Общообразователно Училище \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName ="14 средно общообразователно училище \"проф. д-р асен златаров\"",
                    City = "София"
                },

                new School {
                    Id =96,
                    Name ="29 Средно Общообразователно Училище \"Кузман Шапкарев\"",
                    NormalizedName ="29 средно общообразователно училище \"кузман шапкарев\"",
                    City = "София"
                },

                new School {
                    Id =97,
                    Name ="Професионална Гимназия по Железопътен Транспорт \"Никола Корчев\"",
                    NormalizedName ="професионална гимназия по железопътен транспорт \"никола корчев\"",
                    City = "София"
                },

                new School {
                    Id =98,
                    Name ="ПГ по Вътрешна Архитектура и Дървообработване",
                    NormalizedName ="пг по вътрешна архитектура и дървообработване",
                    City = "София"
                },

                new School {
                    Id =99,
                    Name ="23 Средно Общообразователно Училище \"Фредерик Жолио-Кюри\"",
                    NormalizedName ="23 средно общообразователно училище \"фредерик жолио-кюри\"",
                    City = "София"
                },

                new School {
                    Id =100,
                    Name ="31 Средно Училище за Чужди Езици и Мениджмънт \"Иван Вазов\"",
                    NormalizedName =" 31 средно училище за чужди езици и мениджмънт \"иван вазов\"",
                    City = "София"
                },

                new School {
                    Id =101,
                    Name ="138 СОУ \"Проф. Васил Златарски\"",
                    NormalizedName ="138 соу \"проф. васил златарски\"",
                    City = "София"
                },

                new School {
                    Id =102,
                    Name ="157 Гимназия с изучаване на чужд език \"Сесар Вайехо\"",
                    NormalizedName ="157 гимназия с изучаване на чужд език \"сесар вайехо\"",
                    City = "София"
                },

                new School {
                    Id =103,
                    Name ="Първа Частна Математическа Гимназия",
                    NormalizedName ="първа частна математическа гимназия",
                    City = "София"
                },

                new School {
                    Id =104,
                    Name ="Частна Профилирана Гимназия с Изучаване на Чужди Езици \"Св. Св. Кирил и Методий\"",
                    NormalizedName ="частна профилирана гимназия с изучаване на чужди езици \"св. св. кирил и методий\"",
                    City = "София"
                },

                new School {
                    Id =105,
                    Name ="Частна Профилирана Гимназия \"Образователни Технологии\"",
                    NormalizedName ="частна профилирана гимназия \"образователни технологии\"",
                    City = "София"
                },

                new School {
                    Id =106,
                    Name ="Седмо Средно Общообразователно Училище \"Свети Седмочисленици\"",
                    NormalizedName ="седмо средно общообразователно училище \"свети седмочисленици\"",
                    City = "София"
                },

                new School {
                    Id =107,
                    Name ="9-та Френска Езикова Гимназия \"Алфонс Дьо Ламартин\"",
                    NormalizedName ="9-та френска езикова гимназия \"алфонс дьо ламартин\"",
                    City = "София"
                },

                new School {
                    Id =108,
                    Name ="12 Средно Общообразователно Училище \"Цар Иван Асен II\"",
                    NormalizedName ="12 средно общообразователно училище \"цар иван асен ii\"",
                    City = "София"
                },

                new School {
                    Id =109,
                    Name ="8 Средно Общообразователно Училище \"Васил Левски\"",
                    NormalizedName ="8 средно общообразователно училище \"васил левски\"",
                    City = "София"
                },

                new School {
                    Id =110,
                    Name ="55 Средно Общообразователно Училище \"Петко Каравелов\"",
                    NormalizedName ="55 средно общообразователно училище \"петко каравелов\"",
                    City = "София"
                },

                new School {
                    Id =111,
                    Name ="Професионална Гимназия по Телекомуникации",
                    NormalizedName ="професионална гимназия по телекомуникации",
                    City = "София"
                },

                new School {
                    Id =112,
                    Name ="Частна Гимназия с Езиков и Хуманитарен Профил \"Проф.Д-Р В. Златарски\"",
                    NormalizedName ="частна гимназия с езиков и хуманитарен профил \"проф.д-р в. златарски\"",
                    City = "София"
                },

                new School {
                    Id =113,
                    Name ="Частна Професионална Гимназия по Мултимедия, Компютърен Графичен Дизайн и Анимация",
                    NormalizedName ="частна професионална гимназия по мултимедия, компютърен графичен дизайн и анимация",
                    City = "София"
                },

                new School {
                    Id =114,
                    Name ="22 Средно Общообразователно Училище \"Георги Стойков Раковски\"",
                    NormalizedName ="22 средно общообразователно училище \"георги стойков раковски\"",
                    City = "София"
                },

                new School {
                    Id =115,
                    Name ="121 Средно Общообразователно Училище \"Георги Измирлиев\"",
                    NormalizedName ="121 средно общообразователно училище \"георги измирлиев\"",
                    City = "София"
                },

                new School {
                    Id =116,
                    Name ="Професионална Гимназия по Текстил и Моден Дизайн",
                    NormalizedName ="професионална гимназия по текстил и моден дизайн",
                    City = "София"
                },

                new School {
                    Id =117,
                    Name ="Частно Соу по Изкуства и Чужди Езици \"Артис\"",
                    NormalizedName ="частно соу по изкуства и чужди езици \"артис\"",
                    City = "София"
                },

                new School {
                    Id =118,
                    Name ="Частно Средно Общообразувателно Училище \"Авицена\"",
                    NormalizedName ="частно средно общообразувателно училище \"авицена\"",
                    City = "София"
                },

                new School {
                    Id =119,
                    Name ="18 Средно Общообразователно Училище \"Уилям Гладстон\"",
                    NormalizedName ="18 средно общообразователно училище \"уилям гладстон\"",
                    City = "София"
                },

                new School {
                    Id =120,
                    Name ="Професионална Гимназия по Туризъм \"Алеко Константинов\"",
                    NormalizedName ="професионална гимназия по туризъм \"алеко константинов\"",
                    City = "София"
                },

                new School {
                    Id =121,
                    Name ="2 Средно Общообразователно Училище \"Академик Емилиян Станев\"",
                    NormalizedName ="2 средно общообразователно училище \"академик емилиян станев\"",
                    City = "София"
                },

                new School {
                    Id =122,
                    Name ="Професионална Гимназия по Екология и Биотехнологии \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName ="професионална гимназия по екология и биотехнологии \"проф. д-р асен златаров\"",
                    City = "София"
                },

                new School {
                    Id =123,
                    Name ="Частно Средно Общообразователно Училище \"Св. Георги\"",
                    NormalizedName ="частно средно общообразователно училище \"св. георги\"",
                    City = "София"
                },

                new School {
                    Id =124,
                    Name ="140 Среднообщообразователно Училище \"Иван Богоров\"",
                    NormalizedName ="140 среднообщообразователно училище \"иван богоров\"",
                    City = "София"
                },

                new School {
                    Id =125,
                    Name ="91 Гимназия с Преподаване на Немски Език \"Проф. Константин Гълъбов\"",
                    NormalizedName ="91 гимназия с преподаване на немски език \"проф. константин гълъбов\"",
                    City = "София"
                },

                new School {
                    Id =126,
                    Name ="Вечерно Средно Общообразователно Училище \"Пеньо Пенев\"",
                    NormalizedName ="вечерно средно общообразователно училище \"пеньо пенев\"",
                    City = "София"
                },

                new School {
                    Id =127,
                    Name ="Профилирана Гимназия с Интензивно Изучаване на Румънски Език",
                    NormalizedName ="профилирана гимназия с интензивно изучаване на румънски език",
                    City = "София"
                },

                new School {
                    Id =128,
                    Name ="Професионална Гимназия по Текстилни и Кожени Изделия",
                    NormalizedName ="професионална гимназия по текстилни и кожени изделия",
                    City = "София"
                },

                new School {
                    Id =129,
                    Name ="Софийска Техническа Гимназия",
                    NormalizedName ="софийска техническа гимназия",
                    City = "София"
                },

                new School {
                    Id =130,
                    Name ="Професионална Гимназия по Строителство и Енергетика",
                    NormalizedName ="професионална гимназия по строителство и енергетика",
                    City = "София"
                },

                new School {
                    Id =131,
                    Name ="Частна Профилирана Гимназия \"Веда\"",
                    NormalizedName ="частна профилирана гимназия \"веда\"",
                    City = "София"
                },

                new School {
                    Id =132,
                    Name ="Професионална Гимназия по Фризьорство и Козметика \"Княгиня Евдокия\"",
                    NormalizedName ="професионална гимназия по фризьорство и козметика \"княгиня евдокия\"",
                    City = "София"
                },

                new School {
                    Id =133,
                    Name ="Професионална Гимназия по Хранително Вкусови Технологии \"Проф.Д-Р Г. Павлов\"",
                    NormalizedName ="професионална гимназия по хранително вкусови технологии \"проф.д-р г. павлов\"",
                    City = "София"
                },

                new School {
                    Id =134,
                    Name ="68 Средно Общообразователно Училище \"Академик Никола Обрешков\"",
                    NormalizedName ="68 средно общообразователно училище \"академик никола обрешков\"",
                    City = "София"
                },

                new School {
                    Id =135,
                    Name ="69 Средно Общообразователно Училище \"Димитър Маринов\"",
                    NormalizedName ="69 средно общообразователно училище \"димитър маринов\"",
                    City = "София"
                },

                new School {
                    Id =136,
                    Name ="17 Соу \"Дамян Груев\" с Ранно Обучение по Френски Език",
                    NormalizedName ="17 соу \"дамян груев\" с ранно обучение по френски език",
                    City = "София"
                },

                new School {
                    Id =137,
                    Name ="28 Средно Общообразователно Училище \"Алеко Константинов\"",
                    NormalizedName ="28 средно общообразователно училище \"алеко константинов\"",
                    City = "София"
                },

                new School {
                    Id =138,
                    Name ="57-мо Спортно Училище \"Свети Наум Охридски\"",
                    NormalizedName ="57-мо спортно училище \"свети наум охридски\"",
                    City = "София"
                },

                new School {
                    Id =139,
                    Name ="123 Средно Общообразователно Училище \"Стефан Стамболов\"",
                    NormalizedName ="123 средно общообразователно училище \"стефан стамболов\"",
                    City = "София"
                },

                new School {
                    Id =140,
                    Name ="135 Средно Общообразователно Училище \"Ян Амос Коменски\"",
                    NormalizedName ="135 средно общообразователно училище \"ян амос коменски\"",
                    City = "София"
                },

                new School {
                    Id =141,
                    Name ="Професионална Гимназия по Битова и Електротранспортна Техника",
                    NormalizedName ="професионална гимназия по битова и електротранспортна техника",
                    City = "София"
                },

                new School {
                    Id =142,
                    Name ="Частно Средно Общообразователно Училище \"Орфей\"",
                    NormalizedName ="частно средно общообразователно училище \"орфей\"",
                    City = "София"
                },

                new School {
                    Id =143,
                    Name ="36 Средно Общообразователно Училище \"Максим Горки\"",
                    NormalizedName ="36 средно общообразователно училище \"максим горки\"",
                    City = "София"
                },

                new School {
                    Id =144,
                    Name ="Профилирана Гимназия с Изучаване на Чужди Езици \"Свети Методий\"",
                    NormalizedName ="профилирана гимназия с изучаване на чужди езици \"свети методий\"",
                    City = "София"
                },

                new School {
                    Id =145,
                    Name ="117 Средно Общообразователно Училище \"Св.Св.Кирил и Методий\" (Град Бухово)",
                    NormalizedName ="117 средно общообразователно училище \"св.св.кирил и методий\" (град бухово)",
                    City = "София"
                },

                new School {
                    Id =146,
                    Name ="Професионална Гимназия по Металургия \"Акад. Ив. П. Бардин\"",
                    NormalizedName ="професионална гимназия по металургия \"акад. ив. п. бардин\"",
                    City = "София"
                },

                new School {
                    Id =147,
                    Name ="Първа Частна Професионална Гимназия по Охрана и Сигурност \"Св.Георги Победоносец\"",
                    NormalizedName ="първа частна професионална гимназия по охрана и сигурност \"св.георги победоносец\"",
                    City = "София"
                },

                new School {
                    Id =148,
                    Name ="27 Средно Общообразователно Училище \"Акад. Г. Караславов\"",
                    NormalizedName ="27 средно общообразователно училище \"акад. г. караславов\"",
                    City = "София"
                },

                new School {
                    Id =149,
                    Name ="37 Средно Общообразователно Училище \"Райна Княгиня\"",
                    NormalizedName ="37 средно общообразователно училище \"райна княгиня\"",
                    City = "София"
                },

                new School {
                    Id =150,
                    Name ="33 Езикова Гимназия \"Света София\"",
                    NormalizedName ="33 езикова гимназия \"света софия\"",
                    City = "София"
                },

                new School {
                    Id =151,
                    Name ="10 Средно Общообразователно Училище \"Теодор Траянов\"",
                    NormalizedName ="10 средно общообразователно училище \"теодор траянов\"",
                    City = "София"
                },

                new School {
                    Id =152,
                    Name ="15 Средно Общообразователно Училище \"Адам Мицкевич\"",
                    NormalizedName ="15 средно общообразователно училище \"адам мицкевич\"",
                    City = "София"
                },

                new School {
                    Id =153,
                    Name ="54 Средно Общообразователно Училище \"Св.Иван Рилски\"",
                    NormalizedName ="54 средно общообразователно училище \"св.иван рилски\"",
                    City = "София"
                },

                new School {
                    Id =154,
                    Name ="Професионална Гимназия по Химични и Микробиологични Технологии \"Професор Пенчо Райков\"",
                    NormalizedName ="професионална гимназия по химични и микробиологични технологии \"професор пенчо райков\"",
                    City = "София"
                },

                new School {
                    Id =155,
                    Name ="149 Средно Общообразователно Училище \"Иван Хаджийски\"",
                    NormalizedName ="149 средно общообразователно училище \"иван хаджийски\"",
                    City = "София"
                },

                new School {
                    Id =156,
                    Name ="Професионална Гимназия по Електротехника и Автоматика",
                    NormalizedName ="професионална гимназия по електротехника и автоматика",
                    City = "София"
                },

                new School {
                    Id =157,
                    Name ="Професионална Гимназия по Селско Стопанство \"Бузема\"",
                    NormalizedName ="професионална гимназия по селско стопанство \"бузема\"",
                    City = "София"
                },

                new School {
                    Id =158,
                    Name ="71 Средно Общообразователно Училище \"Пейо Яворов\"",
                    NormalizedName ="71 средно общообразователно училище \"пейо яворов\"",
                    City = "София"
                },

                new School {
                    Id =159,
                    Name ="24 Средно Общообразователно Училище \"П. К. Яворов\"",
                    NormalizedName ="24 средно общообразователно училище \"п. к. яворов\"",
                    City = "София"
                },

                new School {
                    Id =160,
                    Name ="44 Средно Общообразователно Училище \"Неофит Бозвели\"",
                    NormalizedName ="44 средно общообразователно училище \"неофит бозвели\"",
                    City = "София"
                },

                new School {
                    Id =161,
                    Name ="Професионална Гимназия по Топлинна и Хладилна Техника \"Карл Фон Линде\"",
                    NormalizedName ="професионална гимназия по топлинна и хладилна техника \"карл фон линде\"",
                    City = "София"
                },

                new School {
                    Id =162,
                    Name ="93-То Средно Общообразователно Училище \"Александър Теодоров - Балан\"",
                    NormalizedName ="93-то средно общообразователно училище \"александър теодоров - балан\"",
                    City = "София"
                },

                new School {
                    Id =163,
                    Name ="94-То Средно Общообразователно Училище \"Димитър Страшимиров\"",
                    NormalizedName ="94-то средно общообразователно училище \"димитър страшимиров\"",
                    City = "София"
                },

                new School {
                    Id =164,
                    Name ="Професионална Гимназия по Транспорт \"Макгахан\"",
                    NormalizedName ="професионална гимназия по транспорт \"макгахан\"",
                    City = "София"
                },

                new School {
                    Id =165,
                    Name ="127 Средно Общообразователно Училище \"Иван Николаевич Денкоглу\"",
                    NormalizedName ="127 средно общообразователно училище \"иван николаевич денкоглу\"",
                    City = "София"
                },

                new School {
                    Id =166,
                    Name ="133 Средно Общообразователно Училище \"А. С. Пушкин\"",
                    NormalizedName ="133 средно общообразователно училище \"а. с. пушкин\"",
                    City = "София"
                },

                new School {
                    Id =167,
                    Name ="47 Соу \"Христо Г. Данов\"",
                    NormalizedName ="47 соу \"христо г. данов\"",
                    City = "София"
                },

                new School {
                    Id =168,
                    Name ="73 СОУ с Преподаване на Чужди Езици \"Владислав Граматик\"",
                    NormalizedName ="73 соу с преподаване на чужди езици \"владислав граматик\"",
                    City = "София"
                },

                new School {
                    Id =169,
                    Name ="Национална Търговско - Банкова Гимназия",
                    NormalizedName ="национална търговско - банкова гимназия",
                    City = "София"
                },

                new School {
                    Id =170,
                    Name ="Частна Професионална Гимназия по Банково Дело, Търговия и Финанси",
                    NormalizedName ="частна професионална гимназия по банково дело, търговия и финанси",
                    City = "София"
                },

                new School {
                    Id =171,
                    Name ="Частна професионална гимназия по мениджмънт в спорта и в туризма \"Свети Йоан Кръстител и Света Анна\"",
                    NormalizedName ="частна професионална гимназия по мениджмънт в спорта и в туризма \"свети йоан кръстител и света анна\"",
                    City = "София"
                },

                new School {
                    Id =172,
                    Name ="Частна Профилирана Гимназия \"Пейо К. Яворов\"",
                    NormalizedName ="частна профилирана гимназия \"пейо к. яворов\"",
                    City = "София"
                },

                new School {
                    Id =173,
                    Name ="Частна Профилирана Гимназия Балканика",
                    NormalizedName ="частна профилирана гимназия балканика",
                    City = "София"
                },

                new School {
                    Id =174,
                    Name ="Частна Профилирана Гимназия с Изучаване на Английски Език \"Софийска Езикова Гимназия\"",
                    NormalizedName ="частна профилирана гимназия с изучаване на английски език \"софийска езикова гимназия\"",
                    City = "София"
                },

                new School {
                    Id =175,
                    Name ="Средно Общообразователно Училище \"Свети Свети Кирил и Методий\"",
                    NormalizedName ="средно общообразователно училище \"свети свети кирил и методий\"",
                    City = "Пловдив"
                },

                new School {
                    Id =176,
                    Name ="Средно Общообразователно Училище \"Любен Каравелов\"",
                    NormalizedName ="средно общообразователно училище \"любен каравелов\"",
                    City = "Пловдив"
                },

                new School {
                    Id =177,
                    Name ="Професионална Гимназия по Облекло \"Ана Май\"",
                    NormalizedName ="професионална гимназия по облекло \"ана май\"",
                    City = "Пловдив"
                },

                new School {
                    Id =178,
                    Name ="Професионална Гимназия по Машиностроене Пловдив",
                    NormalizedName ="професионална гимназия по машиностроене пловдив",
                    City = "Пловдив"
                },

                new School {
                    Id =179,
                    Name ="Професионална Гимназия по Кожени Изделия и Текстил \"Д-Р Иван Богоров\"",
                    NormalizedName ="професионална гимназия по кожени изделия и текстил \"д-р иван богоров\"",
                    City = "Пловдив"
                },

                new School {
                    Id =180,
                    Name ="Езикова Гимназия \"Иван Вазов\"",
                    NormalizedName ="езикова гимназия \"иван вазов\"",
                    City = "Пловдив"
                },

                new School {
                    Id =181,
                    Name ="Професионална Гимназия по Вътрешна Архитектура и Дървообработване \"Христо Ботев\"",
                    NormalizedName ="професионална гимназия по вътрешна архитектура и дървообработване \"христо ботев\"",
                    City = "Пловдив"
                },

                new School {
                    Id =182,
                    Name ="Средно Общообразователно Училище \"Свети Константин - Кирил Философ\"",
                    NormalizedName ="средно общообразователно училище \"свети константин - кирил философ\"",
                    City = "Пловдив"
                },

                new School {
                    Id =183,
                    Name ="Национална Търговска Гимназия",
                    NormalizedName ="национална търговска гимназия",
                    City = "Пловдив"
                },

                new School {
                    Id =184,
                    Name ="Професионална Гимназия По битова Техника",
                    NormalizedName ="професионална гимназия по битова техника",
                    City = "Пловдив"
                },

                new School {
                    Id =185,
                    Name ="Средно Общообразователно Училище \"Димитър Матевски\"",
                    NormalizedName ="средно общообразователно училище \"димитър матевски\"",
                    City = "Пловдив"
                },

                new School {
                    Id =186,
                    Name ="Средно Общообразователно Училище \"Свети Софроний Врачански\"",
                    NormalizedName ="средно общообразователно училище \"свети софроний врачански\"",
                    City = "Пловдив"
                },

                new School {
                    Id =187,
                    Name ="Частна Профилирана Гимназия \"Академик Любомир Илиев\"",
                    NormalizedName ="частна профилирана гимназия \"академик любомир илиев\"",
                    City = "Пловдив"
                },

                new School {
                    Id =188,
                    Name ="Национална Гимназия За Сценични и Екранни Изкуства",
                    NormalizedName ="национална гимназия за сценични и екранни изкуства",
                    City = "Пловдив"
                },

                new School {
                    Id =189,
                    Name ="Гимназия с Хуманитарен Профил \"Св. Св. Кирил и Методий\"",
                    NormalizedName ="гимназия с хуманитарен профил \"св. св. кирил и методий\"",
                    City = "Пловдив"
                },

                new School {
                    Id =190,
                    Name ="Средно Общообразователно Училище \"Св.Паисий Хилендарски\"",
                    NormalizedName ="средно общообразователно училище \"св.паисий хилендарски\"",
                    City = "Пловдив"
                },

                new School {
                    Id =191,
                    Name ="Средно Общообразователно Училище \"Свети Климент Охридски\"",
                    NormalizedName ="средно общообразователно училище \"свети климент охридски\"",
                    City = "Пловдив"
                },

                new School {
                    Id =192,
                    Name ="Средно Общообразователно Училище \"Свети Патриарх Евтимий\"",
                    NormalizedName ="средно общообразователно училище \"свети патриарх евтимий\"",
                    City = "Пловдив"
                },

                new School {
                    Id =193,
                    Name ="Професионална Гимназия по Електротехника и Електроника",
                    NormalizedName ="професионална гимназия по електротехника и електроника",
                    City = "Пловдив"
                },

                new School {
                    Id =194,
                    Name ="Професионална Гимназия по Туризъм \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName ="професионална гимназия по туризъм \"проф. д-р асен златаров\"",
                    City = "Пловдив"
                },

                new School {
                    Id =195,
                    Name ="Средно Общообразователно Училище \"Найден Геров\"",
                    NormalizedName ="средно общообразователно училище \"найден геров\"",
                    City = "Пловдив"
                },

                new School {
                    Id =196,
                    Name ="Професионална Гимназия по Транспорт \"Гоце Делчев\"",
                    NormalizedName ="професионална гимназия по транспорт \"гоце делчев\"",
                    City = "Пловдив"
                },

                new School {
                    Id =197,
                    Name ="Професионална Гимназия по Строителни Технологии \"Пеньо Пенев\"",
                    NormalizedName ="професионална гимназия по строителни технологии \"пеньо пенев\"",
                    City = "Пловдив"
                },

                new School {
                    Id =198,
                    Name ="Образцова Математическа Гимназия \"Академик Кирил Попов\"",
                    NormalizedName ="образцова математическа гимназия \"академик кирил попов\"",
                    City = "Пловдив"
                },

                new School {
                    Id =199,
                    Name ="Средно Общообразователно Училище \"Никола Йонков Вапцаров\"",
                    NormalizedName ="средно общообразователно училище \"никола йонков вапцаров\"",
                    City = "Пловдив"
                },

                new School {
                    Id =200,
                    Name ="Средно Общообразователноучилище \"Пейо Крачолов Яворов\"",
                    NormalizedName ="средно общообразователноучилище \"пейо крачолов яворов\"",
                    City = "Пловдив"
                },

                new School {
                    Id =201,
                    Name ="Френска Езикова Гимназия \"Антоан Дьо Сент Екзюпери\"",
                    NormalizedName ="френска езикова гимназия \"антоан дьо сент екзюпери\"",
                    City = "Пловдив"
                },

                new School {
                    Id =202,
                    Name ="Вечерна Гимназия \"Христо Смирненски\"",
                    NormalizedName ="вечерна гимназия \"христо смирненски\"",
                    City = "Пловдив"
                },

                new School {
                    Id =203,
                    Name ="Професионална Гимназия по Хранителни Технологии и Техника",
                    NormalizedName ="професионална гимназия по хранителни технологии и техника",
                    City = "Пловдив"
                },

                new School {
                    Id =204,
                    Name ="Професионална Гимназия по Механотехника \"Професор Цветан Лазаров\"",
                    NormalizedName ="професионална гимназия по механотехника \"професор цветан лазаров\"",
                    City = "Пловдив"
                },

                new School {
                    Id =205,
                    Name ="Средно Общообразователно Училище \"Свети Седмочисленици\"",
                    NormalizedName ="средно общообразователно училище \"свети седмочисленици\"",
                    City = "Пловдив"
                },

                new School {
                    Id =206,
                    Name ="Частно Средно общообразователно Училище \"Дружба\"",
                    NormalizedName ="частно средно общообразователно училище \"дружба\"",
                    City = "Пловдив"
                },

                new School {
                    Id =207,
                    Name ="Частна Професионална Гимназия по Икономика и Търговия Пловдив",
                    NormalizedName ="частна професионална гимназия по икономика и търговия пловдив",
                    City = "Пловдив"
                },

                new School {
                    Id =208,
                    Name ="Частна Профилирана Гимназия с Чуждоезиково Обучение \"Стоянстрой\"",
                    NormalizedName ="частна профилирана гимназия с чуждоезиково обучение \"стоянстрой\"",
                    City = "Пловдив"
                },

                new School {
                    Id =209,
                    Name ="Средно Общообразователно Училище \"Цар Симеон Велики\"",
                    NormalizedName ="средно общообразователно училище \"цар симеон велики\"",
                    City = "Пловдив"
                },

                new School {
                    Id =210,
                    Name ="Средно Общообразователно Училище \"Симон Боливар\"",
                    NormalizedName ="средно общообразователно училище \"симон боливар\"",
                    City = "Пловдив"
                },

                new School {
                    Id =211,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия",
                    NormalizedName ="професионална гимназия по строителство, архитектура и геодезия",
                    City = "Пловдив"
                },

                new School {
                    Id =212,
                    Name ="Средно Общообразователно Училище \"Христо Груев Данов\"",
                    NormalizedName ="средно общообразователно училище \"христо груев данов\"",
                    City = "Пловдив"
                },

                new School {
                    Id =213,
                    Name ="Езикова Гимназия \"Пловдив\"",
                    NormalizedName ="езикова гимназия \"пловдив\"",
                    City = "Пловдив"
                },

                new School {
                    Id =214,
                    Name ="Професионална Гимназия по Подемна, Строителна и Транспортна Техника",
                    NormalizedName ="професионална гимназия по подемна, строителна и транспортна техника",
                    City = "Пловдив"
                },

                new School {
                    Id =215,
                    Name ="Средно Общообразователно Училище \"Братя Миладинови\"",
                    NormalizedName ="средно общообразователно училище \"братя миладинови\"",
                    City = "Пловдив"
                },

                new School {
                    Id =216,
                    Name ="Средно Общообразователно Училище \"Константин Величков\"",
                    NormalizedName ="средно общообразователно училище \"константин величков\"",
                    City = "Пловдив"
                },

                new School {
                    Id =217,
                    Name ="Средно-Общообразователно Училище \"Черноризец Храбър\"",
                    NormalizedName ="средно-общообразователно училище \"черноризец храбър\"",
                    City = "Пловдив"
                },

                new School {
                    Id =218,
                    Name ="Частна Профилиранагимназия с Профил Чуждоезиков \"Едмънд Бърк\"",
                    NormalizedName ="частна профилиранагимназия с профил чуждоезиков \"едмънд бърк\"",
                    City = "Пловдив"
                },

                new School {
                    Id =219,
                    Name ="Частна Професионална Гимназия по Икономика и Управление",
                    NormalizedName ="частна професионална гимназия по икономика и управление",
                    City = "Пловдив"
                },

                new School {
                    Id =220,
                    Name ="Частна Профилирана Гимназия \"Класик\"",
                    NormalizedName ="частна профилирана гимназия \"класик\"",
                    City = "Пловдив"
                },

                new School {
                    Id =221,
                    Name ="Частна Професионална Гимназия \"Академик Любомир Илиев\"",
                    NormalizedName ="частна професионална гимназия \"академик любомир илиев\"",
                    City = "Пловдив"
                },

                new School {
                    Id =222,
                    Name ="Средно Общообразователно Училище \"Любен Каравелов\"",
                    NormalizedName ="средно общообразователно училище \"любен каравелов\"",
                    City = "Варна"
                },

                new School {
                    Id =223,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия \"Васил Левски\"",
                    NormalizedName ="професионална гимназия по строителство, архитектура и геодезия \"васил левски\"",
                    City = "Варна"
                },

                new School {
                    Id =224,
                    Name ="Математическа Гимназия \"Д-р Петър Берон\"",
                    NormalizedName ="математическа гимназия \"д-р петър берон\"",
                    City = "Варна"
                },

                new School {
                    Id =225,
                    Name ="?V Езикова Гимназия \"Фредерик Жолио - Кюри\"",
                    NormalizedName ="?v езикова гимназия \"фредерик жолио - кюри\"",
                    City = "Варна"
                },

                new School {
                    Id =226,
                    Name ="Професионална Гимназия по Икономика \"Д-р Иван Богоров\"",
                    NormalizedName ="професионална гимназия по икономика \"д-р иван богоров\"",
                    City = "Варна"
                },

                new School {
                    Id =227,
                    Name ="Първа Езикова Гимназия",
                    NormalizedName ="първа езикова гимназия",
                    City = "Варна"
                },

                new School {
                    Id =228,
                    Name ="Средно Общообразователно Училище \"Гео Милев\"",
                    NormalizedName ="средно общообразователно училище \"гео милев\"",
                    City = "Варна"
                },

                new School {
                    Id =229,
                    Name ="Седмо Средно Общообразователно Училище \"Найден Геров\"",
                    NormalizedName ="седмо средно общообразователно училище \"найден геров\"",
                    City = "Варна"
                },

                new School {
                    Id =230,
                    Name ="Частна Профилирана Гимназия по Информационни Технологии и Обществени Комуникации \"Антоан Дьо Сент-Екзюпери\"",
                    NormalizedName ="частна профилирана гимназия по информационни технологии и обществени комуникации \"антоан дьо сент-екзюпери\"",
                    City = "Варна"
                },

                new School {
                    Id =231,
                    Name ="Трета Природоматематическа Гимназия \"Академик Методий Попов\"",
                    NormalizedName ="трета природоматематическа гимназия \"академик методий попов\"",
                    City = "Варна"
                },

                new School {
                    Id =232,
                    Name ="VIII Средно Общообразователно Училище с Преподаване на Чужди Езици \"Ал. С. Пушкин\"",
                    NormalizedName ="viii средно общообразователно училище с преподаване на чужди езици \"ал. с. пушкин\"",
                    City = "Варна"
                },

                new School {
                    Id =233,
                    Name ="Средно Общообразователно Училище \"Васил Друмев\"",
                    NormalizedName ="средно общообразователно училище \"васил друмев\"",
                    City = "Варна"
                },

                new School {
                    Id =234,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Йоан Екзарх\"",
                    NormalizedName ="гимназия с преподаване на чужди езици \"йоан екзарх\"",
                    City = "Варна"
                },

                new School {
                    Id =235,
                    Name ="Професионална Техническа Гимназия",
                    NormalizedName ="професионална техническа гимназия",
                    City = "Варна"
                },

                new School {
                    Id =236,
                    Name ="Професионална Гимназия по Сградостроителство \"Кольо Фичето\"",
                    NormalizedName ="професионална гимназия по сградостроителство \"кольо фичето\"",
                    City = "Варна"
                },

                new School {
                    Id =237,
                    Name ="Частна Търговска Гимназия",
                    NormalizedName ="частна търговска гимназия",
                    City = "Варна"
                },

                new School {
                    Id =238,
                    Name ="Частна Професионална Гимназия \"Бизнесбанк Училище\"",
                    NormalizedName ="частна професионална гимназия \"бизнесбанк училище\"",
                    City = "Варна"
                },

                new School {
                    Id =239,
                    Name ="Частна Професионална Гимназия по Управление на Туризма \"Константин Фотинов\"",
                    NormalizedName ="частна професионална гимназия по управление на туризма \"константин фотинов\"",
                    City = "Варна"
                },

                new School {
                    Id =240,
                    Name ="Частна Езикова Гимназия с Изучаване на Чужди Езици \"Джордж Байрон\"",
                    NormalizedName ="частна езикова гимназия с изучаване на чужди езици \"джордж байрон\"",
                    City = "Варна"
                },

                new School {
                    Id =241,
                    Name ="Варненска Търговска Гимназия \"Георги Стойков Раковски\"",
                    NormalizedName ="варненска търговска гимназия \"георги стойков раковски\"",
                    City = "Варна"
                },

                new School {
                    Id =242,
                    Name ="Професионална Гимназия по Текстил и Моден Дизайн",
                    NormalizedName ="професионална гимназия по текстил и моден дизайн",
                    City = "Варна"
                },

                new School {
                    Id =243,
                    Name ="Професионална Гимназия по Горско Стопанство и Дървообработване \"Николай Хайтов\"",
                    NormalizedName ="професионална гимназия по горско стопанство и дървообработване \"николай хайтов\"",
                    City = "Варна"
                },

                new School {
                    Id =244,
                    Name ="Професионална Гимназия по Електротехника",
                    NormalizedName ="професионална гимназия по електротехника",
                    City = "Варна"
                },

                new School {
                    Id =245,
                    Name ="Професионална Гимназия по Туризъм \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName ="професионална гимназия по туризъм \"проф. д-р асен златаров\"",
                    City = "Варна"
                },

                new School {
                    Id =246,
                    Name ="Първо СОУ \"Димчо Дебелянов\"",
                    NormalizedName ="първо соу \"димчо дебелянов\"",
                    City = "Варна"
                },

                new School {
                    Id =247,
                    Name ="Частна Езикова Гимназия \"Никанор\"",
                    NormalizedName ="частна езикова гимназия \"никанор\"",
                    City = "Варна"
                },

                new School {
                    Id =248,
                    Name ="Частна професионална гимназия по икономика \"Атанас Буров\"",
                    NormalizedName ="частна професионална гимназия по икономика \"атанас буров\"",
                    City = "Варна"
                },

                new School {
                    Id =249,
                    Name ="Средно Общообразователно Училище \"Елин Пелин\"",
                    NormalizedName ="средно общообразователно училище \"елин пелин\"",
                    City = "Варна"
                },

                new School {
                    Id =250,
                    Name ="Средно Общообразователно Училище \"Пейо Крачолов Яворов\"",
                    NormalizedName ="средно общообразователно училище \"пейо крачолов яворов\"",
                    City = "Варна"
                },

                new School {
                    Id =251,
                    Name ="Средно Общообразователно Училище \"Свети Климент Охридски\"",
                    NormalizedName ="средно общообразователно училище \"свети климент охридски\"",
                    City = "Варна"
                },

                new School {
                    Id =252,
                    Name ="Национална Гимназия За Хуманитарни Науки и Изкуства \"Константин Преславски\"",
                    NormalizedName ="национална гимназия за хуманитарни науки и изкуства \"константин преславски\"",
                    City = "Варна"
                },

                new School {
                    Id =253,
                    Name ="Професионална Гимназия по Химични и Хранително-Вкусови Технологии \"Дм.Ив.Менделеев\"",
                    NormalizedName ="професионална гимназия по химични и хранително-вкусови технологии \"дм.ив.менделеев\"",
                    City = "Варна"
                },

                new School {
                    Id =254,
                    Name ="Професионална Гимназия по Машиностроене и Транспорт",
                    NormalizedName ="професионална гимназия по машиностроене и транспорт",
                    City = "Варна"
                },

                new School {
                    Id =255,
                    Name ="Частна Професионална Гимназия Със Специалности с Интензивно Изучаване на Чужди Езици",
                    NormalizedName ="частна професионална гимназия със специалности с интензивно изучаване на чужди езици",
                    City = "Варна"
                },

                new School {
                    Id =256,
                    Name ="Варненска Морска Гимназия \"Свети Николай Чудотворец\"",
                    NormalizedName ="варненска морска гимназия \"свети николай чудотворец\"",
                    City = "Варна"
                },

                new School {
                    Id =257,
                    Name ="Второ Средно Общообразователно Училище",
                    NormalizedName ="второ средно общообразователно училище",
                    City = "Варна"
                },

                new School {
                    Id =258,
                    Name ="Американска гимназия на България",
                    NormalizedName ="американска гимназия на българия",
                    City = "Варна"
                },
                new School {
                    Id = 259,
                    Name ="Професионална Гимназия по Химични Технологии \"Академик Н. Д. Зелинский\"",
                    NormalizedName = "професионална гимназия по химични технологии \"академик н. д. зелинский\"",
                    City = "Бургас"
                },

                new School {
                    Id = 260,
                    Name ="Природоматематическа Гимназия \"Академик Никола Обрешков\"",
                    NormalizedName = "природоматематическа гимназия \"академик никола обрешков\"",
                    City = "Бургас"
                },

                new School {
                    Id = 261,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия \"Кольо Фичето\"",
                    NormalizedName = "професионална гимназия по строителство, архитектура и геодезия \"кольо фичето\"",
                    City = "Бургас"
                },

                new School {
                    Id = 262,
                    Name ="Професионална Гимназия по Електротехника и Електроника \"Константин Фотинов\"",
                    NormalizedName = "професионална гимназия по електротехника и електроника \"константин фотинов\"",
                    City = "Бургас"
                },

                new School {
                    Id = 263,
                    Name ="Гимназия За Романски Езици Г. С. Раковски",
                    NormalizedName = "гимназия за романски езици г. с. раковски",
                    City = "Бургас"
                },

                new School {
                    Id = 264,
                    Name ="Средно Общообразователно Училище \"Добри Чинтулов\"",
                    NormalizedName = "средно общообразователно училище \"добри чинтулов\"",
                    City = "Бургас"
                },

                new School {
                    Id = 265,
                    Name ="Средно Общообразователноучилище \"Йордан Йовков\"",
                    NormalizedName = "средно общообразователноучилище \"йордан йовков\"",
                    City = "Бургас"
                },

                new School {
                    Id = 266,
                    Name ="Професионална Гимназия по Механоелектротехника и Електроника",
                    NormalizedName = "професионална гимназия по механоелектротехника и електроника",
                    City = "Бургас"
                },

                new School {
                    Id = 267,
                    Name ="Търговска Гимназия",
                    NormalizedName = "търговска гимназия",
                    City = "Бургас"
                },

                new School {
                    Id = 268,
                    Name ="Вечерна Гимназия \"Захари Стоянов\"",
                    NormalizedName = "вечерна гимназия \"захари стоянов\"",
                    City = "Бургас"
                },

                new School {
                    Id = 269,
                    Name ="Частна Профилирана Гимназия с Изучаване на Английски Език \"Британика\"",
                    NormalizedName = "частна профилирана гимназия с изучаване на английски език \"британика\"",
                    City = "Бургас"
                },

                new School {
                    Id = 270,
                    Name ="Гимназия с Преподаване на Английски Език \"Гео Милев\"",
                    NormalizedName = "гимназия с преподаване на английски език \"гео милев\"",
                    City = "Бургас"
                },

                new School {
                    Id = 271,
                    Name ="Средно Общообразователно Училище \"Константин Преславски\"",
                    NormalizedName = "средно общообразователно училище \"константин преславски\"",
                    City = "Бургас"
                },

                new School {
                    Id = 272,
                    Name ="Средно Общообразователно Училище \"Иван Вазов\"",
                    NormalizedName = "средно общообразователно училище \"иван вазов\"",
                    City = "Бургас"
                },

                new School {
                    Id = 273,
                    Name ="Средно Общообразователно Училище \"Димчо Дебелянов\"",
                    NormalizedName = "средно общообразователно училище \"димчо дебелянов\"",
                    City = "Бургас"
                },

                new School {
                    Id = 274,
                    Name ="Средно Общообразователно Училище \"Константин Петканов\"",
                    NormalizedName = "средно общообразователно училище \"константин петканов\"",
                    City = "Бургас"
                },

                new School {
                    Id = 275,
                    Name ="Средно Общообразователно Училище \"Петко Росен\"",
                    NormalizedName = "средно общообразователно училище \"петко росен\"",
                    City = "Бургас"
                },

                new School {
                    Id = 276,
                    Name ="Средно Общообразователно Училище с Хуманитарно-Естетически Профил \"Св.Св. Кирил и Методий\"",
                    NormalizedName = "средно общообразователно училище с хуманитарно-естетически профил \"св.св. кирил и методий\"",
                    City = "Бургас"
                },

                new School {
                    Id = 277,
                    Name ="Гимназия с Преподаване на Немски Език \"Гьоте\"",
                    NormalizedName = "гимназия с преподаване на немски език \"гьоте\"",
                    City = "Бургас"
                },

                new School {
                    Id = 278,
                    Name ="Гимназия За Чужди Езици \"Васил Левски\"",
                    NormalizedName = "гимназия за чужди езици \"васил левски\"",
                    City = "Бургас"
                },

                new School {
                    Id = 279,
                    Name ="Професионална Гимназия по Туризъм \"Проф.Д-Р Асен Златаров\"",
                    NormalizedName = "професионална гимназия по туризъм \"проф.д-р асен златаров\"",
                    City = "Бургас"
                },

                new School {
                    Id = 280,
                    Name ="Професионална Гимназия по Морско Корабоплаване и Риболов \"Свети Никола\"",
                    NormalizedName = "професионална гимназия по морско корабоплаване и риболов \"свети никола\"",
                    City = "Бургас"
                },

                new School {
                    Id = 281,
                    Name ="Професионална Гимназия по Транспорт",
                    NormalizedName = "професионална гимназия по транспорт",
                    City = "Бургас"
                },

                new School {
                    Id = 282,
                    Name ="Професионална Техническа Гимназия",
                    NormalizedName = "професионална техническа гимназия",
                    City = "Бургас"
                },

                new School {
                    Id = 283,
                    Name ="Професионална Гимназия по Дървообработване \"Георги Кондолов\"",
                    NormalizedName = "професионална гимназия по дървообработване \"георги кондолов\"",
                    City = "Бургас"
                },

                new School {
                    Id = 284,
                    Name ="Професионална Гимназия по Сградостроителство и Инсталации \"Пеньо Пенев\"",
                    NormalizedName = "професионална гимназия по сградостроителство и инсталации \"пеньо пенев\"",
                    City = "Бургас"
                },

                new School {
                    Id = 285,
                    Name ="Първо Частно Прогимназиално Училище",
                    NormalizedName = "първо частно прогимназиално училище",
                    City = "Бургас"
                },
                new School {
                    Id = 286,
                    Name ="Професионална Гимназия по Механотехника",
                    NormalizedName = "професионална гимназия по механотехника",
                    City = "Русе"
                },

                new School {
                    Id = 287,
                    Name ="Частна Профилирана Гимназия \"Джордж Байрон\"",
                    NormalizedName = "частна профилирана гимназия \"джордж байрон\"",
                    City = "Русе"
                },

                new School {
                    Id = 288,
                    Name ="Средно Общообразователноучилище \"Васил Левски\"",
                    NormalizedName = "средно общообразователноучилище \"васил левски\"",
                    City = "Русе"
                },

                new School {
                    Id = 289,
                    Name ="Професионална Гимназия по Зърнопреработвателни и Хранителни Технологии \"Проф.Д-р Асен Златаров\"",
                    NormalizedName = "професионална гимназия по зърнопреработвателни и хранителни технологии \"проф.д-р асен златаров\"",
                    City = "Русе"
                },

                new School {
                    Id = 290,
                    Name ="Професионална Гимназия по Икономика и Управление \"Елиас Канети\"",
                    NormalizedName = "професионална гимназия по икономика и управление \"елиас канети\"",
                    City = "Русе"
                },

                new School {
                    Id = 291,
                    Name ="Професионална Гимназия по Дървообработване и Вътрешна Архитектура \"Йосиф Вондрак\"",
                    NormalizedName = "професионална гимназия по дървообработване и вътрешна архитектура \"йосиф вондрак\"",
                    City = "Русе"
                },

                new School {
                    Id = 292,
                    Name ="Професионална Гимназия по Химични Технологии и Биотехнологии \"Проф. Димитър Баларев\"",
                    NormalizedName = "професионална гимназия по химични технологии и биотехнологии \"проф. димитър баларев\"",
                    City = "Русе"
                },

                new School {
                    Id = 293,
                    Name ="Средно Общообразователно Училище с Преподаване на Немски Език \"Фридрих Шилер\"",
                    NormalizedName = "средно общообразователно училище с преподаване на немски език \"фридрих шилер\"",
                    City = "Русе"
                },

                new School {
                    Id = 294,
                    Name ="Математическа Гимназия \"Баба Тонка\"",
                    NormalizedName = "математическа гимназия \"баба тонка\"",
                    City = "Русе"
                },

                new School {
                    Id = 295,
                    Name ="Английска Гимназия \"Гео Милев\"",
                    NormalizedName = "английска гимназия \"гео милев\"",
                    City = "Русе"
                },

                new School {
                    Id = 296,
                    Name ="Средно Общообразователно Училище За Европейски Езици \"Свети Константин-Кирил Философ\"",
                    NormalizedName = "средно общообразователно училище за европейски езици \"свети константин-кирил философ\"",
                    City = "Русе"
                },

                new School {
                    Id = 297,
                    Name ="Първо Частно Средно Общообразователно Училище \"Леонардо Да Винчи\"",
                    NormalizedName = "първо частно средно общообразователно училище \"леонардо да винчи\"",
                    City = "Русе"
                },

                new School {
                    Id = 298,
                    Name ="Професионална Гимназия по Електротехника и Електроника \"Апостол Арнаудов\"",
                    NormalizedName = "професионална гимназия по електротехника и електроника \"апостол арнаудов\"",
                    City = "Русе"
                },

                new School {
                    Id = 299,
                    Name ="Професионална Гимназия по Облекло \"Недка Иван Лазарова\"",
                    NormalizedName = "професионална гимназия по облекло \"недка иван лазарова\"",
                    City = "Русе"
                },

                new School {
                    Id = 300,
                    Name ="Професионална Гимназия по Туризъм \"Иван П. Павлов\"",
                    NormalizedName = "професионална гимназия по туризъм \"иван п. павлов\"",
                    City = "Русе"
                },

                new School {
                    Id = 301,
                    Name ="Професионална Гимназия по Речно Корабостроене и Корабоплаване",
                    NormalizedName = "професионална гимназия по речно корабостроене и корабоплаване",
                    City = "Русе"
                },

                new School {
                    Id = 302,
                    Name ="Професионална Гимназия по Транспорт",
                    NormalizedName = "професионална гимназия по транспорт",
                    City = "Русе"
                },

                new School {
                    Id = 303,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия \"Пеньо Пенев\"",
                    NormalizedName = "професионална гимназия по строителство, архитектура и геодезия \"пеньо пенев\"",
                    City = "Русе"
                },

                new School {
                    Id = 304,
                    Name ="Професионална Гимназия по Промишлени Технологии \"Атанас Цонев Буров\"",
                    NormalizedName = "професионална гимназия по промишлени технологии \"атанас цонев буров\"",
                    City = "Русе"
                },

                new School {
                    Id = 305,
                    Name ="Средно Общообразователно Училище \"Йордан Йовков\"",
                    NormalizedName = "средно общообразователно училище \"йордан йовков\"",
                    City = "Русе"
                },

                new School {
                    Id = 306,
                    Name ="Средно Общообразователно Училище \"Христо Ботев\"",
                    NormalizedName = "средно общообразователно училище \"христо ботев\"",
                    City = "Русе"
                },

                new School {
                    Id = 307,
                    Name ="Средно Общообразователно Училище \"Възраждане\"",
                    NormalizedName = "средно общообразователно училище \"възраждане\"",
                    City = "Русе"
                },

                new School {
                    Id = 308,
                    Name ="Средно Общообразователно Духовно Училище",
                    NormalizedName = "средно общообразователно духовно училище",
                    City = "Русе"
                },

                new School {
                    Id = 309,
                    Name ="Частна Профилирана Гимназия \"Джон Атанасов\"",
                    NormalizedName = "частна профилирана гимназия \"джон атанасов\"",
                    City = "Русе"
                },

                new School {
                    Id = 310,
                    Name ="Професионална Гимназия по Селско Стопанство \"Ангел Кънчев\"",
                    NormalizedName = "професионална гимназия по селско стопанство \"ангел кънчев\"",
                    City = "Русе"
                },

                new School {
                    Id = 311,
                    Name ="Общежитие За Средношколци",
                    NormalizedName = "общежитие за средношколци",
                    City = "Русе"
                },
                new School {
                    Id = 312,
                    Name ="Търговска Гимназия \"Княз Симеон Търновски\" ",
                    NormalizedName = "търговска гимназия \"княз симеон търновски\" ",
                    City = "Стара Загора"
                },

                new School {
                    Id = 313,
                    Name ="Средно Общообразователно Училище \"Железник\"",
                    NormalizedName = "средно общообразователно училище \"железник\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 314,
                    Name ="Природоматематическа Гимназия \"Гео Милев\" Стара Загора",
                    NormalizedName = "природоматематическа гимназия \"гео милев\" стара загора",
                    City = "Стара Загора"
                },

                new School {
                    Id = 315,
                    Name ="Средно Общообразователно Училище \"Максим Горки\"",
                    NormalizedName = "средно общообразователно училище \"максим горки\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 316,
                    Name ="Средно Общообразователно Училище \"Иван Вазов\"",
                    NormalizedName = "средно общообразователно училище \"иван вазов\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 317,
                    Name ="Професионална Гимназия по Механотехника и Транспорт \"Н. Й. Вапцаров\"",
                    NormalizedName = "професионална гимназия по механотехника и транспорт \"н. й. вапцаров\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 318,
                    Name ="Професионална Гимназия по Биотехнологии и Химични Технологии \"Димитрий Менделеев\"",
                    NormalizedName = "професионална гимназия по биотехнологии и химични технологии \"димитрий менделеев\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 319,
                    Name ="Професионална Гимназия по Ветеринарна Медицина \"Иван П. Павлов\"",
                    NormalizedName = "професионална гимназия по ветеринарна медицина \"иван п. павлов\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 320,
                    Name ="Професионална Гимназия по Електроника \"Джон Атанасов\"",
                    NormalizedName = "професионална гимназия по електроника \"джон атанасов\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 321,
                    Name ="Професионална Гимназия по Строителство,Архитектура и Геодезия \"Лубор Байер\"",
                    NormalizedName = "професионална гимназия по строителство,архитектура и геодезия \"лубор байер\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 322,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Ромен Ролан\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"ромен ролан\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 323,
                    Name ="Средно Общообразователно Училище \"Христо Смирненски\"",
                    NormalizedName = "средно общообразователно училище \"христо смирненски\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 324,
                    Name ="Средно Общообразователно Училище \"Васил Левски\"",
                    NormalizedName = "средно общообразователно училище \"васил левски\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 325,
                    Name ="Гимназия \"Христо Ботев\" Стара Загора",
                    NormalizedName = "гимназия \"христо ботев\" стара загора",
                    City = "Стара Загора"
                },

                new School {
                    Id = 326,
                    Name ="Вечерно Соу \"Захари Стоянов\"",
                    NormalizedName = "вечерно соу \"захари стоянов\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 327,
                    Name ="Професионална Гимназияпо Електротехника \"Г. С. Раковски\"",
                    NormalizedName = "професионална гимназияпо електротехника \"г. с. раковски\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 328,
                    Name ="Професионална Гимназия по Строителствои Дървообработване \"Инж. Недьо Ранчев\"",
                    NormalizedName = "професионална гимназия по строителствои дървообработване \"инж. недьо ранчев\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 329,
                    Name ="Професионална Гимназия по Облекло и Хранене \"Райна Княгиня\"",
                    NormalizedName = "професионална гимназия по облекло и хранене \"райна княгиня\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 330,
                    Name ="Частна Профилирана Гимназия \"Траяна\"",
                    NormalizedName = "частна профилирана гимназия \"траяна\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 331,
                    Name ="Частна Професионална Гимназия по Управление на Туризма \"Константин Фотинов\"",
                    NormalizedName = "частна професионална гимназия по управление на туризма \"константин фотинов\"",
                    City = "Стара Загора"
                },

                new School {
                    Id = 332,
                    Name ="Гимназия с Преподаване на Чужди Езици",
                    NormalizedName = "гимназия с преподаване на чужди езици",
                    City = "Плевен"
                },

                new School {
                    Id = 333,
                    Name ="Математическа Гимназия \"Гео Милев\"",
                    NormalizedName = "математическа гимназия \"гео милев\"",
                    City = "Плевен"
                },

                new School {
                    Id = 334,
                    Name ="Средно Общообразователно Училище \"Стоян Заимов\"",
                    NormalizedName = "средно общообразователно училище \"стоян заимов\"",
                    City = "Плевен"
                },

                new School {
                    Id = 335,
                    Name ="Средно Общообразователно Училище \"Иван Вазов\"",
                    NormalizedName = "средно общообразователно училище \"иван вазов\"",
                    City = "Плевен"
                },

                new School {
                    Id = 336,
                    Name ="Средно Общообразователно Училище \"Пейо Крачолов Яворов\"",
                    NormalizedName = "средно общообразователно училище \"пейо крачолов яворов\"",
                    City = "Плевен"
                },

                new School {
                    Id = 337,
                    Name ="Държавна Финансово-Стопанска Гимназия \"Интелект\"",
                    NormalizedName = "държавна финансово-стопанска гимназия \"интелект\"",
                    City = "Плевен"
                },

                new School {
                    Id = 338,
                    Name ="Професионална Гимназия по Хранително-Вкусови Технологии \"Луи Пастьор\"",
                    NormalizedName = "професионална гимназия по хранително-вкусови технологии \"луи пастьор\"",
                    City = "Плевен"
                },

                new School {
                    Id = 339,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия \"Никола Фичев\"",
                    NormalizedName = "професионална гимназия по строителство, архитектура и геодезия \"никола фичев\"",
                    City = "Плевен"
                },

                new School {
                    Id = 340,
                    Name ="Професионална Гимназия по Транспорт \"Проф. Цветан Лазаров\"",
                    NormalizedName = "професионална гимназия по транспорт \"проф. цветан лазаров\"",
                    City = "Плевен"
                },

                new School {
                    Id = 341,
                    Name ="Професионална Гимназия по Електроника и Химични Технологии \"Проф. Асен Златаров\"",
                    NormalizedName = "професионална гимназия по електроника и химични технологии \"проф. асен златаров\"",
                    City = "Плевен"
                },

                new School {
                    Id = 342,
                    Name ="Професионална Гимназия по Лозарство и Винарство \"Александър Стамболийски\"",
                    NormalizedName = "професионална гимназия по лозарство и винарство \"александър стамболийски\"",
                    City = "Плевен"
                },

                new School {
                    Id = 343,
                    Name ="Професионална Гимназия по Подемна, Строителна и Транспортна Техника \"Г.С.Раковски\"",
                    NormalizedName = "професионална гимназия по подемна, строителна и транспортна техника \"г.с.раковски\"",
                    City = "Плевен"
                },

                new School {
                    Id = 344,
                    Name ="Професионална Гимназия по Туризъм \"Алеко Константинов\"",
                    NormalizedName = "професионална гимназия по туризъм \"алеко константинов\"",
                    City = "Плевен"
                },

                new School {
                    Id = 345,
                    Name ="Професионална Гимназия по Облекло и Текстил",
                    NormalizedName = "професионална гимназия по облекло и текстил",
                    City = "Плевен"
                },

                new School {
                    Id = 346,
                    Name ="Професионална Гимназия по Механо-електротехника",
                    NormalizedName = "професионална гимназия по механо-електротехника",
                    City = "Плевен"
                },

                new School {
                    Id = 347,
                    Name ="Прогимназия \"Цветан Спасов\"",
                    NormalizedName = "прогимназия \"цветан спасов\"",
                    City = "Плевен"
                },

                new School {
                    Id = 348,
                    Name ="Средно Общообразователно Училище \"Анастасия Димитрова\"",
                    NormalizedName = "средно общообразователно училище \"анастасия димитрова\"",
                    City = "Плевен"
                },

                new School {
                    Id = 349,
                    Name ="Средно Общообразователно Училище \"Христо Смирненски\"",
                    NormalizedName = "средно общообразователно училище \"христо смирненски\"",
                    City = "Плевен"
                },

                new School {
                    Id = 350,
                    Name ="Професионална Гимназия по Мениджмънт и Хранителни Технологии",
                    NormalizedName = "професионална гимназия по мениджмънт и хранителни технологии",
                    City = "Плевен"
                },

                new School {
                    Id = 351,
                    Name ="Професионална Гимназия по Ресторантьорство, Търговия и Обслужване",
                    NormalizedName = "професионална гимназия по ресторантьорство, търговия и обслужване",
                    City = "Плевен"
                },

                new School {
                    Id = 352,
                    Name ="Частна Профилирана Гимназия \"Иком Интелект\"",
                    NormalizedName = "частна профилирана гимназия \"иком интелект\"",
                    City = "Плевен"
                },

                new School {
                    Id = 353,
                    Name ="Професионална Гимназия \"Захарий Зограф\"",
                    NormalizedName = "професионална гимназия \"захарий зограф\"",
                    City = "Плевен"
                },

                new School {
                    Id = 354,
                    Name ="Общоградско Средношколско Общежитие",
                    NormalizedName = "общоградско средношколско общежитие",
                    City = "Плевен"
                },
                new School {
                    Id = 355,
                    Name ="Професионална Гимназия по Механотехника и Електротехника \"Михаил Василиевич Ломоносов\"",
                    NormalizedName = "професионална гимназия по механотехника и електротехника \"михаил василиевич ломоносов\"",
                    City = "Добрич"
                },

                new School {
                    Id = 356,
                    Name ="Профилирана Гимназия по Туризъм и Предприемачество \"Райко Цончев\"",
                    NormalizedName = "профилирана гимназия по туризъм и предприемачество \"райко цончев\"",
                    City = "Добрич"
                },

                new School {
                    Id = 357,
                    Name ="Професионална Гимназия по Ветеринарна Медицина \"Проф. Д-Р Георги Павлов\"",
                    NormalizedName = "професионална гимназия по ветеринарна медицина \"проф. д-р георги павлов\"",
                    City = "Добрич"
                },

                new School {
                    Id = 358,
                    Name ="Професионална Гимназия по Аграрно Стопанство",
                    NormalizedName = "професионална гимназия по аграрно стопанство",
                    City = "Добрич"
                },

                new School {
                    Id = 359,
                    Name ="Средно Общообразователно Училище \"Димитър Талев - Гр. Добрич\"",
                    NormalizedName = "средно общообразователно училище \"димитър талев - гр. добрич\"",
                    City = "Добрич"
                },

                new School {
                    Id = 360,
                    Name ="Средно Общообразователно Училище \"Дора Габе\"",
                    NormalizedName = "средно общообразователно училище \"дора габе\"",
                    City = "Добрич"
                },

                new School {
                    Id = 361,
                    Name ="Средно Общообразователно Училище \"Петко Рачов Славейков\"",
                    NormalizedName = "средно общообразователно училище \"петко рачов славейков\"",
                    City = "Добрич"
                },

                new School {
                    Id = 362,
                    Name ="Природоматематическа Гимназия \"Иван Вазов\"",
                    NormalizedName = "природоматематическа гимназия \"иван вазов\"",
                    City = "Добрич"
                },

                new School {
                    Id = 363,
                    Name ="Езикова Гимназия \"Гео Милев\"",
                    NormalizedName = "езикова гимназия \"гео милев\"",
                    City = "Добрич"
                },

                new School {
                    Id = 364,
                    Name ="Частна Профилирана Гимназия \"Леонардо Да Винчи\"",
                    NormalizedName = "частна профилирана гимназия \"леонардо да винчи\"",
                    City = "Добрич"
                },

                new School {
                    Id = 365,
                    Name ="Професионална Гимназия по Транспорт, Обслужване и Лека Промишленост",
                    NormalizedName = "професионална гимназия по транспорт, обслужване и лека промишленост",
                    City = "Добрич"
                },

                new School {
                    Id = 366,
                    Name ="Средно Общообразователно Училище \"Свети Климент Охридски\"",
                    NormalizedName = "средно общообразователно училище \"свети климент охридски\"",
                    City = "Добрич"
                },

                new School {
                    Id = 367,
                    Name ="Средно Общообразователно Училище \"Любен Каравелов\"",
                    NormalizedName = "средно общообразователно училище \"любен каравелов\"",
                    City = "Добрич"
                },

                new School {
                    Id = 368,
                    Name ="Финансово-Стопанска Гимназия \"Васил Левски\"",
                    NormalizedName = "финансово-стопанска гимназия \"васил левски\"",
                    City = "Добрич"
                },

                new School {
                    Id = 369,
                    Name ="Професионална Гимназия по Строителство и Архитектура \"Пеньо Пенев\"",
                    NormalizedName = "професионална гимназия по строителство и архитектура \"пеньо пенев\"",
                    City = "Добрич"
                },

                new School {
                    Id = 370,
                    Name ="Професионална Гимназия по Туризъм \"П. К. Яворов\"",
                    NormalizedName = "професионална гимназия по туризъм \"п. к. яворов\"",
                    City = "Добрич"
                },
                new School {
                    Id = 371,
                    Name ="Професионална Гимназия по Текстил и Облекло \"Добри Желязков\"",
                    NormalizedName = "професионална гимназия по текстил и облекло \"добри желязков\"",
                    City = "Сливен"
                },

                new School {
                    Id = 372,
                    Name ="Природо - Математическа Гимназия \"Добри П. Чинтулов\"",
                    NormalizedName = "природо - математическа гимназия \"добри п. чинтулов\"",
                    City = "Сливен"
                },

                new School {
                    Id = 373,
                    Name ="10-то Средно Общообразователно Училище \"Йордан Йовков\"",
                    NormalizedName = "10-то средно общообразователно училище \"йордан йовков\"",
                    City = "Сливен"
                },

                new School {
                    Id = 374,
                    Name ="11-то Средно Общообразователно Училище \"Константин Константинов\"",
                    NormalizedName = "11-то средно общообразователно училище \"константин константинов\"",
                    City = "Сливен"
                },

                new School {
                    Id = 375,
                    Name ="Професионална Гимназия по Електротехника и Електроника \"Мария Склодовска-Кюри\"",
                    NormalizedName = "професионална гимназия по електротехника и електроника \"мария склодовска-кюри\"",
                    City = "Сливен"
                },

                new School {
                    Id = 376,
                    Name ="Професионална Гимназия по Икономика \"Професор Д-r Димитър Табаков\"",
                    NormalizedName = "професионална гимназия по икономика \"професор д-r димитър табаков\"",
                    City = "Сливен"
                },

                new School {
                    Id = 377,
                    Name ="Професионална Гимназия по Хотелиерство и Туризъм \"Акад. Неделчо Неделчев\"",
                    NormalizedName = "професионална гимназия по хотелиерство и туризъм \"акад. неделчо неделчев\"",
                    City = "Сливен"
                },

                new School {
                    Id = 378,
                    Name ="Сливенска Професионална Гимназия по Строителство и Геодезия \"Арх. Георги Козаров\"",
                    NormalizedName = "сливенска професионална гимназия по строителство и геодезия \"арх. георги козаров\"",
                    City = "Сливен"
                },

                new School {
                    Id = 379,
                    Name ="Гимназия с преподаване на западни езици \"Захари Стоянов\"",
                    NormalizedName = "гимназия с преподаване на западни езици \"захари стоянов\"",
                    City = "Сливен"
                },

                new School {
                    Id = 380,
                    Name ="Хуманитарна Гимназия \"Дамян Дамянов\"",
                    NormalizedName = "хуманитарна гимназия \"дамян дамянов\"",
                    City = "Сливен"
                },

                new School {
                    Id = 381,
                    Name ="5-то Средно Общообразователно Училище \"Пейо Крачолов Яворов\"",
                    NormalizedName = "5-то средно общообразователно училище \"пейо крачолов яворов\"",
                    City = "Сливен"
                },

                new School {
                    Id = 382,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия",
                    NormalizedName = "професионална гимназия по строителство, архитектура и геодезия",
                    City = "Шумен"
                },

                new School {
                    Id = 383,
                    Name ="Професионална Гимназия по Облекло, Хранене и Химични Технологии \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName = "професионална гимназия по облекло, хранене и химични технологии \"проф. д-р асен златаров\"",
                    City = "Шумен"
                },

                new School {
                    Id = 384,
                    Name ="Средно Общообразователно Училище \"Панайот Волов\"",
                    NormalizedName = "средно общообразователно училище \"панайот волов\"",
                    City = "Шумен"
                },

                new School {
                    Id = 385,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Никола Йонков Вапцаров\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"никола йонков вапцаров\"",
                    City = "Шумен"
                },

                new School {
                    Id = 386,
                    Name ="Средно Общообразователно Училище \"Васил Левски\"",
                    NormalizedName = "средно общообразователно училище \"васил левски\"",
                    City = "Шумен"
                },

                new School {
                    Id = 387,
                    Name ="Професионална Гимназия по Механотехника, Електроника, Телекомуникации и Транспорт \"Христо Ботев\"",
                    NormalizedName = "професионална гимназия по механотехника, електроника, телекомуникации и транспорт \"христо ботев\"",
                    City = "Шумен"
                },

                new School {
                    Id = 388,
                    Name ="Професионална Гимназия по Машиностроене",
                    NormalizedName = "професионална гимназия по машиностроене",
                    City = "Шумен"
                },

                new School {
                    Id = 389,
                    Name ="Професионална Гимназия по Икономика",
                    NormalizedName = "професионална гимназия по икономика",
                    City = "Шумен"
                },

                new School {
                    Id = 390,
                    Name ="Професионална Гимназия по Селско Стопанство и Хранителни Технологии",
                    NormalizedName = "професионална гимназия по селско стопанство и хранителни технологии",
                    City = "Шумен"
                },

                new School {
                    Id = 391,
                    Name ="Средно Общообразователно Училище \"Трайко Симеонов\"",
                    NormalizedName = "средно общообразователно училище \"трайко симеонов\"",
                    City = "Шумен"
                },

                new School {
                    Id = 392,
                    Name ="Средно Общообразователно Училище \"Йоан Екзарх Български\"",
                    NormalizedName = "средно общообразователно училище \"йоан екзарх български\"",
                    City = "Шумен"
                },

                new School {
                    Id = 393,
                    Name ="Средно Общообразователно Училище \"Сава Доброплодни\"",
                    NormalizedName = "средно общообразователно училище \"сава доброплодни\"",
                    City = "Шумен"
                },

                new School {
                    Id = 395,
                    Name ="Природо-Математическа Гимназия \"Христо Смирненски\"",
                    NormalizedName = "природо-математическа гимназия \"христо смирненски\"",
                    City = "Перник"
                },

                new School {
                    Id = 396,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Симеон Радев\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"симеон радев\"",
                    City = "Перник"
                },

                new School {
                    Id = 397,
                    Name ="Професионална Техничека Гимназия \"Юрий Гагарин\"",
                    NormalizedName = "професионална техничека гимназия \"юрий гагарин\"",
                    City = "Перник"
                },

                new School {
                    Id = 398,
                    Name ="Технологична Професионална Гимназия \"Мария Кюри\"",
                    NormalizedName = "технологична професионална гимназия \"мария кюри\"",
                    City = "Перник"
                },

                new School {
                    Id = 399,
                    Name ="Професионална Гимназия по Икономика",
                    NormalizedName = "професионална гимназия по икономика",
                    City = "Перник"
                },

                new School {
                    Id = 400,
                    Name ="Средно Общообразователно Училище \"Свети Климент Охридски\"",
                    NormalizedName = "средно общообразователно училище \"свети климент охридски\"",
                    City = "Перник"
                },

                new School {
                    Id = 401,
                    Name ="Пето Средно Общообразователно Училище \"Петко Рачов Славейков\"",
                    NormalizedName = "пето средно общообразователно училище \"петко рачов славейков\"",
                    City = "Перник"
                },

                new School {
                    Id = 402,
                    Name ="Шесто Средно Общообразователно Училище \"Св. Св. Кирил и Методий\"",
                    NormalizedName = "шесто средно общообразователно училище \"св. св. кирил и методий\"",
                    City = "Перник"
                },

                new School {
                    Id = 403,
                    Name ="СОУ с Разширено Изучаване на Чужди Езици \"Д-Р Петър Берон\"",
                    NormalizedName = "соу с разширено изучаване на чужди езици \"д-р петър берон\"",
                    City = "Перник"
                },

                new School {
                    Id = 404,
                    Name ="Професионална Гимназия по Енергетика и Минна Промишленост \"Христо Ботев\"",
                    NormalizedName = "професионална гимназия по енергетика и минна промишленост \"христо ботев\"",
                    City = "Перник"
                },

                new School {
                    Id = 405,
                    Name ="Професионална Гимназия по Облекло и Туризъм \"Свети Иван Рилски\"",
                    NormalizedName = "професионална гимназия по облекло и туризъм \"свети иван рилски\"",
                    City = "Перник"
                },


                new School {
                    Id = 406,
                    Name ="Професионална Гимназия по Хранителни Технологии и Туризъм",
                    NormalizedName = "професионална гимназия по хранителни технологии и туризъм",
                    City = "Ямбол"
                },

                new School {
                    Id = 407,
                    Name ="Гимназия \"Васил Левски\"",
                    NormalizedName = "гимназия \"васил левски\"",
                    City = "Ямбол"
                },

                new School {
                    Id = 408,
                    Name ="Математическа Гимназия \"Атанас Радев\"",
                    NormalizedName = "математическа гимназия \"атанас радев\"",
                    City = "Ямбол"
                },

                new School {
                    Id = 409,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Васил Карагьозов\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"васил карагьозов\"",
                    City = "Ямбол"
                },

                new School {
                    Id = 410,
                    Name ="Професионална Гимназия по Икономика \"Георги Стойков Раковски\"",
                    NormalizedName = "професионална гимназия по икономика \"георги стойков раковски\"",
                    City = "Ямбол"
                },

                new School {
                    Id = 411,
                    Name ="Професионална Гимназия по Строителство и Геодезия \"К. Фичето\"",
                    NormalizedName = "професионална гимназия по строителство и геодезия \"к. фичето\"",
                    City = "Ямбол"
                },

                new School {
                    Id = 412,
                    Name ="Професионална Гимназия по Подемна, Строителна и Транспортна Техника \"Н. Й. Вапцаров\"",
                    NormalizedName = "професионална гимназия по подемна, строителна и транспортна техника \"н. й. вапцаров\"",
                    City = "Ямбол"
                },

                new School {
                    Id = 413,
                    Name ="Професионална Гимназия по Лека Промишленост, Екология и Химични Технологии",
                    NormalizedName = "професионална гимназия по лека промишленост, екология и химични технологии",
                    City = "Ямбол"
                },

                new School {
                    Id = 414,
                    Name ="Професионална Гимназия по Земеделие \"Христо Ботев\"",
                    NormalizedName = "професионална гимназия по земеделие \"христо ботев\"",
                    City = "Ямбол"
                },

                new School {
                    Id = 415,
                    Name ="Професионална Гимназия по Туризъм \"Александър Паскалев\"",
                    NormalizedName = "професионална гимназия по туризъм \"александър паскалев\"",
                    City = "Хасково"
                },

                new School {
                    Id = 416,
                    Name ="Гимназия с Преподаванена Чужди Езици \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName = "гимназия с преподаванена чужди езици \"проф. д-р асен златаров\"",
                    City = "Хасково"
                },

                new School {
                    Id = 417,
                    Name ="Професионална Гимназия по Дървообработване и Строителство \"Цар Иван Асен ?I\"",
                    NormalizedName = "професионална гимназия по дървообработване и строителство \"цар иван асен ?i\"",
                    City = "Хасково"
                },

                new School {
                    Id = 418,
                    Name ="Средно Общообразователно Училище \"Васил Левски\"",
                    NormalizedName = "средно общообразователно училище \"васил левски\"",
                    City = "Хасково"
                },

                new School {
                    Id = 419,
                    Name ="Природо-Математическа Гимназия \"Академик Боян Петканчин\"",
                    NormalizedName = "природо-математическа гимназия \"академик боян петканчин\"",
                    City = "Хасково"
                },

                new School {
                    Id = 420,
                    Name ="Професионална Гимназия по Транспорт \"Н.Й.Вапцаров\"",
                    NormalizedName = "професионална гимназия по транспорт \"н.й.вапцаров\"",
                    City = "Хасково"
                },

                new School {
                    Id = 421,
                    Name ="Професионална Гимназия по Механоелектротехника \"Стойчо и Кица Марчеви\"",
                    NormalizedName = "професионална гимназия по механоелектротехника \"стойчо и кица марчеви\"",
                    City = "Хасково"
                },

                new School {
                    Id = 422,
                    Name ="Финансово-Стопанска Гимназия \"Атанас Буров\"",
                    NormalizedName = "финансово-стопанска гимназия \"атанас буров\"",
                    City = "Хасково"
                },

                new School {
                    Id = 423,
                    Name ="Средно Общообразователно Училище \"Св.Паисий Хилендарски\"",
                    NormalizedName = "средно общообразователно училище \"св.паисий хилендарски\"",
                    City = "Хасково"
                },

                new School {
                    Id = 424,
                    Name ="Професионална Гимназия по Селско Стопанство",
                    NormalizedName = "професионална гимназия по селско стопанство",
                    City = "Хасково"
                },

                new School {
                    Id = 425,
                    Name ="Професионална Гимназия по Лека Промишленост",
                    NormalizedName = "професионална гимназия по лека промишленост",
                    City = "Хасково"
                },

                new School {
                    Id = 426,
                    Name ="Професионална Гимназия по Облекло",
                    NormalizedName = "професионална гимназия по облекло",
                    City = "Пазарджик"
                },

                new School {
                    Id = 427,
                    Name ="Професионална Гимназия по Промишлени Технологии",
                    NormalizedName = "професионална гимназия по промишлени технологии",
                    City = "Пазарджик"
                },

                new School {
                    Id = 428,
                    Name ="Средно Общообразователно Училище \"Георги Брегов\"",
                    NormalizedName = "средно общообразователно училище \"георги брегов\"",
                    City = "Пазарджик"
                },

                new School {
                    Id = 429,
                    Name ="Професионална Гимназия по Строителство и Архитектура",
                    NormalizedName = "професионална гимназия по строителство и архитектура",
                    City = "Пазарджик"
                },

                new School {
                    Id = 430,
                    Name ="Математическа Гимназия \"Константин Величков\"",
                    NormalizedName = "математическа гимназия \"константин величков\"",
                    City = "Пазарджик"
                },

                new School {
                    Id = 431,
                    Name ="Гимназия \"Иван Сергеевич Аксаков\"",
                    NormalizedName = "гимназия \"иван сергеевич аксаков\"",
                    City = "Пазарджик"
                },

                new School {
                    Id = 432,
                    Name ="Професионална Гимназияпо Механоелектротехника",
                    NormalizedName = "професионална гимназияпо механоелектротехника",
                    City = "Пазарджик"
                },

                new School {
                    Id = 433,
                    Name ="Езикова Гимназия \"Бертолт Брехт\"",
                    NormalizedName = "езикова гимназия \"бертолт брехт\"",
                    City = "Пазарджик"
                },

                new School {
                    Id = 434,
                    Name ="Средно Общообразователно Училище \"Георги Бенковски\"",
                    NormalizedName = "средно общообразователно училище \"георги бенковски\"",
                    City = "Пазарджик"
                },

                new School {
                    Id = 435,
                    Name ="Средно Общообразователно Училище \"Д-Р Петър Берон\"",
                    NormalizedName = "средно общообразователно училище \"д-р петър берон\"",
                    City = "Пазарджик"
                },

                new School {
                    Id = 436,
                    Name ="Професионална Гимназия по Икономика и Мениджмънт",
                    NormalizedName = "професионална гимназия по икономика и мениджмънт",
                    City = "Пазарджик"
                },

                new School {
                    Id = 437,
                    Name ="Прогимназия \"Св. Св. Кирил и Методий\"",
                    NormalizedName = "прогимназия \"св. св. кирил и методий\"",
                    City = "Пазарджик"
                },

                new School {
                    Id = 438,
                    Name ="Професионална Гимназия по Селско Стопанство \"Царица Йоанна\"",
                    NormalizedName = "професионална гимназия по селско стопанство \"царица йоанна\"",
                    City = "Пазарджик"
                },

                new School {
                    Id = 439,
                    Name ="Професионална Гимназия по Химични и Хранителни Технологии",
                    NormalizedName = "професионална гимназия по химични и хранителни технологии",
                    City = "Пазарджик"
                },

                new School {
                    Id = 440,
                    Name ="Езикова Гимназия \"Акад. Людмил Стоянов\"",
                    NormalizedName = "езикова гимназия \"акад. людмил стоянов\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 441,
                    Name ="Природо-Математическа Гимназия \"Акад. Сергей Павлович Корольов\"",
                    NormalizedName = "природо-математическа гимназия \"акад. сергей павлович корольов\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 442,
                    Name ="Частна Професионална Гимназия по Предприемачество и Нови Технологии \"Полет\"",
                    NormalizedName = "частна професионална гимназия по предприемачество и нови технологии \"полет\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 443,
                    Name ="Професионална Гимназия по Икономика \"Иван Илиев\"",
                    NormalizedName = "професионална гимназия по икономика \"иван илиев\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 444,
                    Name ="Средно Общообразователно Училище с Изучаване на Чужди Езици \"Свети Климент Охридски\"",
                    NormalizedName = "средно общообразователно училище с изучаване на чужди езици \"свети климент охридски\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 445,
                    Name ="Професионална Гимназия по Текстил и Облекло",
                    NormalizedName = "професионална гимназия по текстил и облекло",
                    City = "Благоевград"
                },

                new School {
                    Id = 446,
                    Name ="Национална Хуманитарна Гимназия \"Св.Св.Кирил и Методий\"",
                    NormalizedName = "национална хуманитарна гимназия \"св.св.кирил и методий\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 447,
                    Name ="Професионална Гимназия по Електротехника и Електроника \"Никола Йонков Вапцаров\"",
                    NormalizedName = "професионална гимназия по електротехника и електроника \"никола йонков вапцаров\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 448,
                    Name ="Седмо Средно Общообразователно Училище \"Кузман Шапкарев\"",
                    NormalizedName = "седмо средно общообразователно училище \"кузман шапкарев\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 449,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия \"В.Левски\"",
                    NormalizedName = "професионална гимназия по строителство, архитектура и геодезия \"в.левски\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 450,
                    Name ="Професионална Техническа Гимназия \"Ичко Бойчев\"",
                    NormalizedName = "професионална техническа гимназия \"ичко бойчев\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 451,
                    Name ="Осмо Средно Общообразователно Училище \"Арсени Костенцев\"",
                    NormalizedName = "осмо средно общообразователно училище \"арсени костенцев\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 452,
                    Name ="Средно Общообразователно Училище \"Иван Вазов\"",
                    NormalizedName = "средно общообразователно училище \"иван вазов\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 453,
                    Name ="Пето Средно Общообразователно Училище \"Георги Измирлиев\"",
                    NormalizedName = "пето средно общообразователно училище \"георги измирлиев\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 454,
                    Name ="Частна Вечерна Гимназия \"Димитър & Йоан\"",
                    NormalizedName = "частна вечерна гимназия \"димитър & йоан\"",
                    City = "Благоевград"
                },

                new School {
                    Id = 455,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия \"Ангел Попов\"",
                    NormalizedName = "професионална гимназия по строителство, архитектура и геодезия \"ангел попов\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 456,
                    Name ="Хуманитарна Гимназия \"Св.Св. Кирил и Методий\"",
                    NormalizedName = "хуманитарна гимназия \"св.св. кирил и методий\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 457,
                    Name ="Частна Профилирана Гимназия \"Американски Колеж - Аркус\"",
                    NormalizedName = "частна профилирана гимназия \"американски колеж - аркус\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 458,
                    Name ="Природо-математическа Гимназия \"Васил Друмев\"",
                    NormalizedName = "природо-математическа гимназия \"васил друмев\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 459,
                    Name ="Езикова Гимназия \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName = "езикова гимназия \"проф. д-р асен златаров\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 460,
                    Name ="Средно Общообразователно Училище \"Владимир Комаров\"",
                    NormalizedName = "средно общообразователно училище \"владимир комаров\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 461,
                    Name ="Старопрестолна Гимназия по Икономика",
                    NormalizedName = "старопрестолна гимназия по икономика",
                    City = "Велико Търново"
                },

                new School {
                    Id = 462,
                    Name ="Професионална Гимназия по Моден Дизайн",
                    NormalizedName = "професионална гимназия по моден дизайн",
                    City = "Велико Търново"
                },

                new School {
                    Id = 463,
                    Name ="Професионална Гимназия по Туризъм \"Д-Р Васил Берон\"",
                    NormalizedName = "професионална гимназия по туризъм \"д-р васил берон\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 464,
                    Name ="Професионална Гимназия по Сградостроителство \"Кольо Фичето\"",
                    NormalizedName = "професионална гимназия по сградостроителство \"кольо фичето\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 465,
                    Name ="Частна Професионална Гимназия по Мениджмънт",
                    NormalizedName = "частна професионална гимназия по мениджмънт",
                    City = "Велико Търново"
                },

                new School {
                    Id = 466,
                    Name ="Средно Общообразователно Училище \"Емилиян Станев\"",
                    NormalizedName = "средно общообразователно училище \"емилиян станев\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 467,
                    Name ="Средно Общообразователно Училище \"Вела Благоева\"",
                    NormalizedName = "средно общообразователно училище \"вела благоева\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 468,
                    Name ="Средно Общообразователно Училище \"Георги Стойков Раковски\"",
                    NormalizedName = "средно общообразователно училище \"георги стойков раковски\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 469,
                    Name ="Професионална Гимназия по Електроника \"Александър Степанович Попов\"",
                    NormalizedName = "професионална гимназия по електроника \"александър степанович попов\"",
                    City = "Велико Търново"
                },

                new School {
                    Id = 470,
                    Name ="Професионална Гимназия по Строителство и Архитектура",
                    NormalizedName = "професионална гимназия по строителство и архитектура",
                    City = "Враца"
                },

                new School {
                    Id = 471,
                    Name ="Професионална Гимназия по Търговия и Ресторантьорство",
                    NormalizedName = "професионална гимназия по търговия и ресторантьорство",
                    City = "Враца"
                },

                new School {
                    Id = 472,
                    Name ="Средно Общообразователно Училище \"Козма Тричков\"",
                    NormalizedName = "средно общообразователно училище \"козма тричков\"",
                    City = "Враца"
                },

                new School {
                    Id = 473,
                    Name ="Природо Математическа Гимназия \"Академик Иван Ценов\"",
                    NormalizedName = "природо математическа гимназия \"академик иван ценов\"",
                    City = "Враца"
                },

                new School {
                    Id = 474,
                    Name ="Средно Общообразователно Училище \"Отец Паисий\"",
                    NormalizedName = "средно общообразователно училище \"отец паисий\"",
                    City = "Враца"
                },

                new School {
                    Id = 475,
                    Name ="Професионална Техническа Гимназия \"Н.Йонков Вапцаров\"",
                    NormalizedName = "професионална техническа гимназия \"н.йонков вапцаров\"",
                    City = "Враца"
                },

                new School {
                    Id = 476,
                    Name ="Средно Общообразователно Училище \"Христо Ботев\"",
                    NormalizedName = "средно общообразователно училище \"христо ботев\"",
                    City = "Враца"
                },

                new School {
                    Id = 477,
                    Name ="Езикова Гимназия \"Йоан Екзарх\"",
                    NormalizedName = "езикова гимназия \"йоан екзарх\"",
                    City = "Враца"
                },

                new School {
                    Id = 478,
                    Name ="Средно Общообразователно Училище \"Васил Кънчов\"",
                    NormalizedName = "средно общообразователно училище \"васил кънчов\"",
                    City = "Враца"
                },

                new School {
                    Id = 479,
                    Name ="Професионална Гимназия по Лека Промишленост и Услуги - Враца",
                    NormalizedName = "професионална гимназия по лека промишленост и услуги - враца",
                    City = "Враца"
                },

                new School {
                    Id = 480,
                    Name ="Среднообщообразователно Училище \"Никола Войводов\"",
                    NormalizedName = "среднообщообразователно училище \"никола войводов\"",
                    City = "Враца"
                },

                new School {
                    Id = 481,
                    Name ="Професионална Гимназия по Туризъм \"Пенчо Семов\"",
                    NormalizedName = "професионална гимназия по туризъм \"пенчо семов\"",
                    City = "Габрово"
                },

                new School {
                    Id = 482,
                    Name ="Национална Априловска Гимназия",
                    NormalizedName = "национална априловска гимназия",
                    City = "Габрово"
                },

                new School {
                    Id = 483,
                    Name ="Природоматематическа Гимназия \"Академик Иван Гюзелев\"",
                    NormalizedName = "природоматематическа гимназия \"академик иван гюзелев\"",
                    City = "Габрово"
                },

                new School {
                    Id = 484,
                    Name ="Професионална Гимназия по Строителство",
                    NormalizedName = "професионална гимназия по строителство",
                    City = "Габрово"
                },

                new School {
                    Id = 485,
                    Name ="Професионална Гимназия по Текстил и Моден Дизайн",
                    NormalizedName = "професионална гимназия по текстил и моден дизайн",
                    City = "Габрово"
                },

                new School {
                    Id = 486,
                    Name ="Средно Общо Образователно Училище \"Отец Паисий\"",
                    NormalizedName = "средно общо образователно училище \"отец паисий\"",
                    City = "Габрово"
                },

                new School {
                    Id = 487,
                    Name ="Средно Общообразователно Училище \"Райчо Каролев\"",
                    NormalizedName = "средно общообразователно училище \"райчо каролев\"",
                    City = "Габрово"
                },

                new School {
                    Id = 488,
                    Name ="Професионалнатехническа Гимназия \"Д-Р Никола Василиади\"",
                    NormalizedName = "професионалнатехническа гимназия \"д-р никола василиади\"",
                    City = "Габрово"
                },
                new School {
                    Id = 489,
                    Name ="Професионална Техническа Гимназия \"Васил Левски\"",
                    NormalizedName = "професионална техническа гимназия \"васил левски\"",
                    City = "Видин"
                },

                new School {
                    Id = 490,
                    Name ="Средно Общообразователно Училище \"Любен Каравелов\"",
                    NormalizedName = "средно общообразователно училище \"любен каравелов\"",
                    City = "Видин"
                },

                new School {
                    Id = 491,
                    Name ="Професионална Гимназия по Облекло и Хранене \"Михалаки Георгиев\"",
                    NormalizedName = "професионална гимназия по облекло и хранене \"михалаки георгиев\"",
                    City = "Видин"
                },

                new School {
                    Id = 492,
                    Name ="Професионална Гимназия \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName = "професионална гимназия \"проф. д-р асен златаров\"",
                    City = "Видин"
                },

                new School {
                    Id = 493,
                    Name ="Средно Общообразователно Училище \"Петко Рачов Славейков\"",
                    NormalizedName = "средно общообразователно училище \"петко рачов славейков\"",
                    City = "Видин"
                },

                new School {
                    Id = 494,
                    Name ="Средно Общообразователно Училище \"Цар Симеон Велики\"",
                    NormalizedName = "средно общообразователно училище \"цар симеон велики\"",
                    City = "Видин"
                },

                new School {
                    Id = 495,
                    Name ="Природоматематическа Гимназия \"Екзарх Антим I\"",
                    NormalizedName = "природоматематическа гимназия \"екзарх антим i\"",
                    City = "Видин"
                },

                new School {
                    Id = 496,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Йордан Радичков\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"йордан радичков\"",
                    City = "Видин"
                },

                new School {
                    Id = 497,
                    Name ="Средно Общообразователно Училище \"Христо Ботев\"",
                    NormalizedName = "средно общообразователно училище \"христо ботев\"",
                    City = "Видин"
                },

                new School {
                    Id = 498,
                    Name ="Средно Общообразователно Училище \"Св. Св. Кирил и Методий\"",
                    NormalizedName = "средно общообразователно училище \"св. св. кирил и методий\"",
                    City = "Видин"
                },

                new School {
                    Id = 499,
                    Name ="Средно Общообразователно Училище \"Свети Свети Кирил и Методий\"",
                    NormalizedName = "средно общообразователно училище \"свети свети кирил и методий\"",
                    City = "Асеновград"
                },

                new School {
                    Id = 500,
                    Name ="Професионална Гимназия по Хранително-Вкусови Технологии \"Св. Димитрий Солунски\"",
                    NormalizedName = "професионална гимназия по хранително-вкусови технологии \"св. димитрий солунски\"",
                    City = "Асеновград"
                },

                new School {
                    Id = 501,
                    Name ="Средно Общообразователно Училище \"Свети Княз Борис I\"",
                    NormalizedName = "средно общообразователно училище \"свети княз борис i\"",
                    City = "Асеновград"
                },

                new School {
                    Id = 502,
                    Name ="Професионална Гимназия \"Свети Патриарх Евтимий\"",
                    NormalizedName = "професионална гимназия \"свети патриарх евтимий\"",
                    City = "Асеновград"
                },

                new School {
                    Id = 503,
                    Name ="Професионална Гимназия \"Цар Иван Асен II\"",
                    NormalizedName = "професионална гимназия \"цар иван асен ii\"",
                    City = "Асеновград"
                },

                new School {
                    Id = 504,
                    Name ="Професионална Гимназия \"Иван Хаджиенов\"",
                    NormalizedName = "професионална гимназия \"иван хаджиенов\"",
                    City = "Казанлък"
                },

                new School {
                    Id = 505,
                    Name ="Национална Гимназия по Пластични Изкуства и Дизайн \"Академик Дечко Узунов\"",
                    NormalizedName = "национална гимназия по пластични изкуства и дизайн \"академик дечко узунов\"",
                    City = "Казанлък"
                },

                new School {
                    Id = 506,
                    Name ="Гимназия \"Академик Петко Стайнов\"",
                    NormalizedName = "гимназия \"академик петко стайнов\"",
                    City = "Казанлък"
                },

                new School {
                    Id = 507,
                    Name ="Природоматематическа Гимназаия \"Никола Обрешков\"",
                    NormalizedName = "природоматематическа гимназаия \"никола обрешков\"",
                    City = "Казанлък"
                },

                new School {
                    Id = 508,
                    Name ="Средно Общообразователно Училище \"Екзарх Антим I\"",
                    NormalizedName = "средно общообразователно училище \"екзарх антим i\"",
                    City = "Казанлък"
                },

                new School {
                    Id = 509,
                    Name ="Професионална Гимназия по Лека Промишленост и Туризъм",
                    NormalizedName = "професионална гимназия по лека промишленост и туризъм",
                    City = "Казанлък"
                },

                new School {
                    Id = 510,
                    Name ="Хуманитарна Гимназия \"Св.Св.Кирил и Методий\"",
                    NormalizedName = "хуманитарна гимназия \"св.св.кирил и методий\"",
                    City = "Казанлък"
                },

                new School {
                    Id = 511,
                    Name ="Професионална Гимназия по Транспорт и Транспортен Мениджмънт",
                    NormalizedName = "професионална гимназия по транспорт и транспортен мениджмънт",
                    City = "Казанлък"
                },

                new School {
                    Id = 512,
                    Name ="Професионална Гимназия по Строителство",
                    NormalizedName = "професионална гимназия по строителство",
                    City = "Казанлък"
                },

                new School {
                    Id = 513,
                    Name ="Професионална Гимназия по Дървообработване и Горско Стопанство \"Г. С. Раковски\"",
                    NormalizedName = "професионална гимназия по дървообработване и горско стопанство \"г. с. раковски\"",
                    City = "Кюстендил"
                },

                new School {
                    Id = 514,
                    Name ="Природоматематическа Гимназия \"Проф. Емануил Иванов\"",
                    NormalizedName = "природоматематическа гимназия \"проф. емануил иванов\"",
                    City = "Кюстендил"
                },

                new School {
                    Id = 515,
                    Name ="Професионална Гимназия по Икономика и Мениджмънт \"Йордан Захариев\"",
                    NormalizedName = "професионална гимназия по икономика и мениджмънт \"йордан захариев\"",
                    City = "Кюстендил"
                },

                new School {
                    Id = 516,
                    Name ="Професионална Гимназия по Туризъм \"Никола Йонков Вапцаров\"",
                    NormalizedName = "професионална гимназия по туризъм \"никола йонков вапцаров\"",
                    City = "Кюстендил"
                },

                new School {
                    Id = 517,
                    Name ="Гимназия \"Неофит Рилски\"",
                    NormalizedName = "гимназия \"неофит рилски\"",
                    City = "Кюстендил"
                },

                new School {
                    Id = 518,
                    Name ="Езикова Гимназия \"Д-Р Петър Берон\"",
                    NormalizedName = "езикова гимназия \"д-р петър берон\"",
                    City = "Кюстендил"
                },

                new School {
                    Id = 519,
                    Name ="Професионална Техническа Гимназия \"Джон Атанасов\"",
                    NormalizedName = "професионална техническа гимназия \"джон атанасов\"",
                    City = "Кюстендил"
                },

                new School {
                    Id = 520,
                    Name ="Професионална Гимназия по Лека Промишленост \"Владимир Димитров-Майстора\"",
                    NormalizedName = "професионална гимназия по лека промишленост \"владимир димитров-майстора\"",
                    City = "Кюстендил"
                },

                new School {
                    Id = 521,
                    Name ="Средно Общообразователно Училище с Природо-Математическа Насоченост \"Отец Паисий\"",
                    NormalizedName = "средно общообразователно училище с природо-математическа насоченост \"отец паисий\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 522,
                    Name ="Средно Общообразователно Училище \"Петко Рачов Славейков\"",
                    NormalizedName = "средно общообразователно училище \"петко рачов славейков\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 523,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Христо Ботев\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"христо ботев\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 524,
                    Name ="Професионална Гимназия по Икономика \"Алеко Константинов\"",
                    NormalizedName = "професионална гимназия по икономика \"алеко константинов\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 525,
                    Name ="Професионална Гимназия по Туризъм \"Проф. Д-р Асен Златаров\"",
                    NormalizedName = "професионална гимназия по туризъм \"проф. д-р асен златаров\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 526,
                    Name ="Професионална Гимназия \"Васил Левски\"",
                    NormalizedName = "професионална гимназия \"васил левски\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 527,
                    Name ="Професионална Гимназия по Електротехника и Електроника \"Капитан Петко Войвода\"",
                    NormalizedName = "професионална гимназия по електротехника и електроника \"капитан петко войвода\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 528,
                    Name ="Средно Общообразователно Училище \"Йордан Йовков\"",
                    NormalizedName = "средно общообразователно училище \"йордан йовков\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 529,
                    Name ="Средно Общообразователно Училище \"Владимир Димитров - Майстора\"",
                    NormalizedName = "средно общообразователно училище \"владимир димитров - майстора\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 530,
                    Name ="СОУ \"Свети Климент Охридски\"",
                    NormalizedName = "соу \"свети климент охридски\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 531,
                    Name ="Професионална Гимназия по Облекло и Дизай \"Евридика\"",
                    NormalizedName = "професионална гимназия по облекло и дизай \"евридика\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 532,
                    Name ="Професионална Гимназия по Селско и Горско Стопанство",
                    NormalizedName = "професионална гимназия по селско и горско стопанство",
                    City = "Кърджали"
                },

                new School {
                    Id = 533,
                    Name ="Професионална Гимназия по Строителство \"Христо Смирненски\"",
                    NormalizedName = "професионална гимназия по строителство \"христо смирненски\"",
                    City = "Кърджали"
                },

                new School {
                    Id = 534,
                    Name ="Професионална Гимназия по Строителство, Архитектура и Геодезия",
                    NormalizedName = "професионална гимназия по строителство, архитектура и геодезия",
                    City = "Монтана"
                },

                new School {
                    Id = 535,
                    Name ="Природо-Математическа Гимназия \"Свети Климент Охридски\"",
                    NormalizedName = "природо-математическа гимназия \"свети климент охридски\"",
                    City = "Монтана"
                },

                new School {
                    Id = 536,
                    Name ="Второ Средно Общообразователно Училище \"Никола Йонков Вапцаров\"",
                    NormalizedName = "второ средно общообразователно училище \"никола йонков вапцаров\"",
                    City = "Монтана"
                },

                new School {
                    Id = 537,
                    Name ="Професионална Техническа Гимназия \"Юрий Гагарин\"",
                    NormalizedName = "професионална техническа гимназия \"юрий гагарин\"",
                    City = "Монтана"
                },

                new School {
                    Id = 538,
                    Name ="Финансово-Стопанска Гимназия \"Васил Левски\"",
                    NormalizedName = "финансово-стопанска гимназия \"васил левски\"",
                    City = "Монтана"
                },

                new School {
                    Id = 539,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Петърбогдан\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"петърбогдан\"",
                    City = "Монтана"
                },

                new School {
                    Id = 540,
                    Name ="Пето Средно Общообразователно Училище \"Христо Ботев\"",
                    NormalizedName = "пето средно общообразователно училище \"христо ботев\"",
                    City = "Монтана"
                },

                new School {
                    Id = 541,
                    Name ="Осмо Средно Общообразователно Училище \"Отец Паисий\"",
                    NormalizedName = "осмо средно общообразователно училище \"отец паисий\"",
                    City = "Монтана"
                },

                new School {
                    Id = 542,
                    Name ="Девето Средно Общообразователно Училище \"Йордан Радичков\"",
                    NormalizedName = "девето средно общообразователно училище \"йордан радичков\"",
                    City = "Монтана"
                },

                new School {
                    Id = 543,
                    Name ="Професионална Гимназия по Лека Промишленост",
                    NormalizedName = "професионална гимназия по лека промишленост",
                    City = "Монтана"
                },

                new School {
                    Id = 544,
                    Name ="Професионална Гимназия по Електротехника \"Христо Ботев\"",
                    NormalizedName = "професионална гимназия по електротехника \"христо ботев\"",
                    City = "Монтана"
                },

                new School {
                    Id = 545,
                    Name ="Професионална Гимназия Димитровград",
                    NormalizedName = "професионална гимназия димитровград",
                    City = "Димитровград"
                },

                new School {
                    Id = 546,
                    Name ="Професионална Гимназия по Химични и Хранителни Технологии \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName = "професионална гимназия по химични и хранителни технологии \"проф. д-р асен златаров\"",
                    City = "Димитровград"
                },

                new School {
                    Id = 547,
                    Name ="Природо-Математическа Гимназия със Засилено изучаване на Чужди Езици \"Иван Вазов\"",
                    NormalizedName = "природо-математическа гимназия със засилено изучаване на чужди езици \"иван вазов\"",
                    City = "Димитровград"
                },

                new School {
                    Id = 548,
                    Name ="Средно Общообразователно Училище \"Любен Каравелов\"",
                    NormalizedName = "средно общообразователно училище \"любен каравелов\"",
                    City = "Димитровград"
                },

                new School {
                    Id = 549,
                    Name ="Езикова Гимназия \"Д-Р Иван Богоров\"",
                    NormalizedName = "езикова гимназия \"д-р иван богоров\"",
                    City = "Димитровград"
                },

                new School {
                    Id = 550,
                    Name ="Средно Общообразователно Училище \"Васил Левски\"",
                    NormalizedName = "средно общообразователно училище \"васил левски\"",
                    City = "Димитровград"
                },

                new School {
                    Id = 551,
                    Name ="Второ Средно Общообразователно Училище \"Професор Никола Маринов\"",
                    NormalizedName = "второ средно общообразователно училище \"професор никола маринов\"",
                    City = "Търговище"
                },

                new School {
                    Id = 552,
                    Name ="Първо Средно Общообразователно Училище \"Свети Седмочисленици\"",
                    NormalizedName = "първо средно общообразователно училище \"свети седмочисленици\"",
                    City = "Търговище"
                },

                new School {
                    Id = 553,
                    Name ="Профилирана Гимназия с Изучаване на Чужди Езици \"Митрополит Андрей\"",
                    NormalizedName = "профилирана гимназия с изучаване на чужди езици \"митрополит андрей\"",
                    City = "Търговище"
                },

                new School {
                    Id = 554,
                    Name ="Пг по Икономическа Информатика \"Джон Атанасов\"",
                    NormalizedName = "пг по икономическа информатика \"джон атанасов\"",
                    City = "Търговище"
                },

                new School {
                    Id = 555,
                    Name ="Професионална Техническа Гимназия \"Цар Симеон Велики\"",
                    NormalizedName = "професионална техническа гимназия \"цар симеон велики\"",
                    City = "Търговище"
                },

                new School {
                    Id = 556,
                    Name ="Професионална Гимназия по Туризъм и Хранително-Вкусови Технологии \"Алеко Константинов\"",
                    NormalizedName = "професионална гимназия по туризъм и хранително-вкусови технологии \"алеко константинов\"",
                    City = "Търговище"
                },

                new School {
                    Id = 557,
                    Name ="Професионална Гимназия по Земеделие",
                    NormalizedName = "професионална гимназия по земеделие",
                    City = "Търговище"
                },

                new School {
                    Id = 558,
                    Name ="Професионална Гимназия по Електротехника и Строителство",
                    NormalizedName = "професионална гимназия по електротехника и строителство",
                    City = "Търговище"
                },

                new School {
                    Id = 559,
                    Name ="Природоматематическа Гимназия \"Св.Климент Охридски\"",
                    NormalizedName = "природоматематическа гимназия \"св.климент охридски\"",
                    City = "Силистра"
                },

                new School {
                    Id = 560,
                    Name ="Езикова Гимназия \"Пейо Яворов\"",
                    NormalizedName = "езикова гимназия \"пейо яворов\"",
                    City = "Силистра"
                },

                new School {
                    Id = 561,
                    Name ="Професионална Гимназия по Механотехника \"Владимир Комаров\"",
                    NormalizedName = "професионална гимназия по механотехника \"владимир комаров\"",
                    City = "Силистра"
                },

                new School {
                    Id = 562,
                    Name ="Професионална Гимназия по Строителство \"Пеньо Пенев\"",
                    NormalizedName = "професионална гимназия по строителство \"пеньо пенев\"",
                    City = "Силистра"
                },

                new School {
                    Id = 563,
                    Name ="Средно Общообразователно Училище \"Юрий Алексеевич Гагарин\"",
                    NormalizedName = "средно общообразователно училище \"юрий алексеевич гагарин\"",
                    City = "Силистра"
                },

                new School {
                    Id = 564,
                    Name ="Средно Общообразователно Училище \"Никола Йонков Вапцаров\"",
                    NormalizedName = "средно общообразователно училище \"никола йонков вапцаров\"",
                    City = "Силистра"
                },

                new School {
                    Id = 565,
                    Name ="Професионална Гимназия по Стопанскоуправление, Администрация и Услуги \"Атанас Буров\"",
                    NormalizedName = "професионална гимназия по стопанскоуправление, администрация и услуги \"атанас буров\"",
                    City = "Силистра"
                },

                new School {
                    Id = 566,
                    Name ="Професионална Земеделска Гимназия \"Добруджа\"",
                    NormalizedName = "професионална земеделска гимназия \"добруджа\"",
                    City = "Силистра"
                },

                new School {
                    Id = 567,
                    Name ="Професионална Гимназия Полека Промишленост \"Пенчо Славейков\"",
                    NormalizedName = "професионална гимназия полека промишленост \"пенчо славейков\"",
                    City = "Силистра"
                },

                new School {
                    Id = 568,
                    Name ="Професионална Гимназия по Производствени Технологии \"Евлогий Георгиев\"",
                    NormalizedName = "професионална гимназия по производствени технологии \"евлогий георгиев\"",
                    City = "Силистра"
                },

                new School {
                    Id = 569,
                    Name ="Обединено Общежитие За Средношколци \"Младост\"",
                    NormalizedName = "обединено общежитие за средношколци \"младост\"",
                    City = "Силистра"
                },

                new School {
                    Id = 570,
                    Name ="Професионална Гимназия по Ветеринарна Медицина \"Проф. Д-Р Димитър Димов\"",
                    NormalizedName = "професионална гимназия по ветеринарна медицина \"проф. д-р димитър димов\"",
                    City = "Ловеч"
                },

                new School {
                    Id = 571,
                    Name ="Средно Общообразователно Училище \"Тодор Кирков\"",
                    NormalizedName = "средно общообразователно училище \"тодор кирков\"",
                    City = "Ловеч"
                },

                new School {
                    Id = 572,
                    Name ="редно Общообразователно Училище \"Св.Климент Охридски\"",
                    NormalizedName = "редно общообразователно училище \"св.климент охридски\"",
                    City = "Ловеч"
                },

                new School {
                    Id = 573,
                    Name ="Природо-Математическа Гимназия",
                    NormalizedName = "природо-математическа гимназия",
                    City = "Ловеч"
                },

                new School {
                    Id = 574,
                    Name ="Гимназия За Чужди Езици \"Екзарх Йосиф I\"",
                    NormalizedName = "гимназия за чужди езици \"екзарх йосиф i\"",
                    City = "Ловеч"
                },

                new School {
                    Id = 575,
                    Name ="Професионална Гимназия по Кожарство, Облекло и Химични Технологии \"Марийка и Маринчо Караконови\"",
                    NormalizedName = "професионална гимназия по кожарство, облекло и химични технологии \"марийка и маринчо караконови\"",
                    City = "Ловеч"
                },

                new School {
                    Id = 576,
                    Name ="Професионална Гимназия по Икономика, Търговия и Услуги",
                    NormalizedName = "професионална гимназия по икономика, търговия и услуги",
                    City = "Ловеч"
                },

                new School {
                    Id = 577,
                    Name ="Средно Общообразователно Училище \"Панайот Пипков\"",
                    NormalizedName = "средно общообразователно училище \"панайот пипков\"",
                    City = "Ловеч"
                },

                new School {
                    Id = 578,
                    Name ="Професионална Гимназия по Механоелектротехника",
                    NormalizedName = "професионална гимназия по механоелектротехника",
                    City = "Ловеч"
                },

                new School {
                    Id = 579,
                    Name ="Средно Общообразователно Училище \"Св. Паисий Хилендарски\"",
                    NormalizedName = "средно общообразователно училище \"св. паисий хилендарски\"",
                    City = "Дупница"
                },

                new School {
                    Id = 580,
                    Name ="Гимназия \"Христо Ботев\"",
                    NormalizedName = "гимназия \"христо ботев\"",
                    City = "Дупница"
                },

                new School {
                    Id = 581,
                    Name ="Вечерно Средно Общообразователно Училище \"Димчо Дебелянов\"",
                    NormalizedName = "вечерно средно общообразователно училище \"димчо дебелянов\"",
                    City = "Дупница"
                },

                new School {
                    Id = 582,
                    Name ="Професионална Гимназия по Облекло и Стопанско Управление",
                    NormalizedName = "професионална гимназия по облекло и стопанско управление",
                    City = "Дупница"
                },

                new School {
                    Id = 583,
                    Name ="Професионална Гимназия по Транспорт",
                    NormalizedName = "професионална гимназия по транспорт",
                    City = "Дупница"
                },

                new School {
                    Id = 584,
                    Name ="Професионална Гимназия \"Акад. Сергей П. Корольов\"",
                    NormalizedName = "професионална гимназия \"акад. сергей п. корольов\"",
                    City = "Дупница"
                },

                new School {
                    Id = 585,
                    Name ="Професионална Гимназия по Хранително - Вкусови и Химични Технологии",
                    NormalizedName = "професионална гимназия по хранително - вкусови и химични технологии",
                    City = "Дупница"
                },

                new School {
                    Id = 586,
                    Name ="Професионална Техническа Гимназия \"Шандор Петьофи\"",
                    NormalizedName = "професионална техническа гимназия \"шандор петьофи\"",
                    City = "Разград"
                },

                new School {
                    Id = 587,
                    Name ="Професионална Гимназия по Химични Технологии и Биотехнологии \"Мария Кюри\"",
                    NormalizedName = "професионална гимназия по химични технологии и биотехнологии \"мария кюри\"",
                    City = "Разград"
                },

                new School {
                    Id = 588,
                    Name ="Природо-математическа Гимназия \"Акад.Никола Обрешков\"",
                    NormalizedName = "природо-математическа гимназия \"акад.никола обрешков\"",
                    City = "Разград"
                },

                new School {
                    Id = 589,
                    Name ="Професионална Гимназия по Икономика \"Робер Шуман\"",
                    NormalizedName = "професионална гимназия по икономика \"робер шуман\"",
                    City = "Разград"
                },

                new School {
                    Id = 590,
                    Name ="Професионална Гимназия по Селско Стопанство и Хранително-Вкусови Технологии \"Ангел Кънчев\"",
                    NormalizedName = "професионална гимназия по селско стопанство и хранително-вкусови технологии \"ангел кънчев\"",
                    City = "Разград"
                },

                new School {
                    Id = 591,
                    Name ="Професионална Гимназия по Транспорт и Строителство \"Христо Смирненски\"",
                    NormalizedName = "професионална гимназия по транспорт и строителство \"христо смирненски\"",
                    City = "Разград"
                },

                new School {
                    Id = 592,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Екзарх Йосиф\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"екзарх йосиф\"",
                    City = "Разград"
                },

                new School {
                    Id = 593,
                    Name ="Средно Общообразователно Училище \"Христо Ботев\"",
                    NormalizedName = "средно общообразователно училище \"христо ботев\"",
                    City = "Разград"
                },

                new School {
                    Id = 594,
                    Name ="Професионална Гимназия по Облекло \"Станка Николица Спасо-Еленина\"",
                    NormalizedName = "професионална гимназия по облекло \"станка николица спасо-еленина\"",
                    City = "Разград"
                },

                new School {
                    Id = 595,
                    Name ="Общежитие За Средношколци Гр. Разград",
                    NormalizedName = "общежитие за средношколци гр. разград",
                    City = "Разград"
                },

                new School {
                    Id = 596,
                    Name ="Средно Общообразователно Училище \"Цветан Радославов\"",
                    NormalizedName = "средно общообразователно училище \"цветан радославов\"",
                    City = "Разград"
                },

                new School {
                    Id = 597,
                    Name ="Средно Общообразователноучилище \"Николай Катранов\"",
                    NormalizedName = "средно общообразователноучилище \"николай катранов\"",
                    City = "Разград"
                },

                new School {
                    Id = 598,
                    Name ="Държавна Търговска Гимназия \"Димитър Хадживасилев\"",
                    NormalizedName = "държавна търговска гимназия \"димитър хадживасилев\"",
                    City = "Разград"
                },

                new School {
                    Id = 599,
                    Name ="Професионална Гимназия \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName = "професионална гимназия \"проф. д-р асен златаров\"",
                    City = "Разград"
                },

                new School {
                    Id = 600,
                    Name ="Професионална Гимназия по Лека Промишленост и Строителство",
                    NormalizedName = "професионална гимназия по лека промишленост и строителство",
                    City = "Разград"
                },

                new School {
                    Id = 601,
                    Name ="Средно Общообразователно Училище \"Алеко Константинов\"",
                    NormalizedName = "средно общообразователно училище \"алеко константинов\"",
                    City = "Разград"
                },

                new School {
                    Id = 602,
                    Name ="Средно Общообразователно Училище \"Димитър Благоев\"",
                    NormalizedName = "средно общообразователно училище \"димитър благоев\"",
                    City = "Разград"
                },

                new School {
                    Id = 603,
                    Name ="Професионална Техническа Гимназия \"Васил Левски\"",
                    NormalizedName = "професионална техническа гимназия \"васил левски\"",
                    City = "Горна Оряховица"
                },

                new School {
                    Id = 604,
                    Name ="Професионална Гимназия по Лека Промишленост и Икономика \"Атанас Буров\"",
                    NormalizedName = "професионална гимназия по лека промишленост и икономика \"атанас буров\"",
                    City = "Горна Оряховица"
                },

                new School {
                    Id = 605,
                    Name ="Средно Общообразователно Училище \"Георги Измирлиев\"",
                    NormalizedName = "средно общообразователно училище \"георги измирлиев\"",
                    City = "Горна Оряховица"
                },

                new School {
                    Id = 606,
                    Name ="Средно Общообразователно Училище \"Вичо Грънчаров\"",
                    NormalizedName = "средно общообразователно училище \"вичо грънчаров\"",
                    City = "Горна Оряховица"
                },

                new School {
                    Id = 607,
                    Name ="Професионална Гимназия по Електротехника и Електроника \"Михайло Василиевич Ломоносов\"",
                    NormalizedName = "професионална гимназия по електротехника и електроника \"михайло василиевич ломоносов\"",
                    City = "Горна Оряховица"
                },

                new School {
                    Id = 608,
                    Name ="Професионална Гимназия по Хранителни Технологии \"Проф.Д-Р Асен Златаров\"",
                    NormalizedName = "професионална гимназия по хранителни технологии \"проф.д-р асен златаров\"",
                    City = "Горна Оряховица"
                },

                new School {
                    Id = 609,
                    Name ="Професионална Гимназия по Железопътен Транспорт \"Н.Й.Вапцаров\"",
                    NormalizedName = "професионална гимназия по железопътен транспорт \"н.й.вапцаров\"",
                    City = "Горна Оряховица"
                },

                new School {
                    Id = 611,
                    Name ="Гимназия с Преподаване на Чужди Езици \"Иван Вазов\"",
                    NormalizedName = "гимназия с преподаване на чужди езици \"иван вазов\"",
                    City = "Смолян"
                },

                new School {
                    Id = 612,
                    Name ="Професионална Гимназия по Икономика \"Карл Маркс\"",
                    NormalizedName = "професионална гимназия по икономика \"карл маркс\"",
                    City = "Смолян"
                },

                new School {
                    Id = 613,
                    Name ="Природоматематическа Гимназия \"Васил Левски\"",
                    NormalizedName = "природоматематическа гимназия \"васил левски\"",
                    City = "Смолян"
                },

                new School {
                    Id = 614,
                    Name ="Средно Общообразователно Училище \"Отец Паисий\"",
                    NormalizedName = "средно общообразователно училище \"отец паисий\"",
                    City = "Смолян"
                },

                new School {
                    Id = 615,
                    Name ="Професионална Гимназия Потехника и Технологии \"Христо Ботев\"",
                    NormalizedName = "професионална гимназия потехника и технологии \"христо ботев\"",
                    City = "Смолян"
                },

                new School {
                    Id = 616,
                    Name ="Професионална Гимназия по Строителство \"Никола Вапцаров\"",
                    NormalizedName = "професионална гимназия по строителство \"никола вапцаров\"",
                    City = "Смолян"
                },

                new School {
                    Id = 617,
                    Name ="Професионална Гимназия по Туризъм",
                    NormalizedName = "професионална гимназия по туризъм",
                    City = "Смолян"
                },

                 new School {
                    Id = 618,
                    Name ="Частна Професионална Гимназия по Управление на Туризма \"Константин Фотинов\"",
                    NormalizedName = "частна професионална гимназия по управление на туризма \"константин фотинов\"",
                    City = "Смолян"
                },

                 new School {
                    Id = 619,
                    Name ="Професионална Гимназия по Механоелектротехника \"Юрий Гагарин\"",
                    NormalizedName = "професионална гимназия по механоелектротехника \"юрий гагарин\"",
                    City = "Петрич"
                },

                new School {
                    Id = 620,
                    Name ="Професионална Гимназия по Икономика и Туризъм \"Проф. Д-Р Асен Златаров\"",
                    NormalizedName = "професионална гимназия по икономика и туризъм \"проф. д-р асен златаров\"",
                    City = "Петрич"
                },

                new School {
                    Id = 621,
                    Name ="Средно Общообразователно Училище \"Никола Йонков Вапцаров\"",
                    NormalizedName = "средно общообразователно училище \"никола йонков вапцаров\"",
                    City = "Петрич"
                },

                new School {
                    Id = 622,
                    Name ="Гимназия \"Пейо К. Яворов\"",
                    NormalizedName = "гимназия \"пейо к. яворов\"",
                    City = "Петрич"
                },

                new School {
                    Id = 623,
                    Name ="Средно Общообразователно Училище \"Антон Попов\"",
                    NormalizedName = "средно общообразователно училище \"антон попов\"",
                    City = "Петрич"
                },

                new School {
                    Id = 624,
                    Name ="Професионална Гимназия по Лека Промишленост \"А.А. - Малчика\"",
                    NormalizedName = "професионална гимназия по лека промишленост \"а.а. - малчика\"",
                    City = "Петрич"
                },
                new School {
                    Id = 625,
                    Name ="Професионална Гимназия по Туризъм",
                    NormalizedName = "професионална гимназия по туризъм",
                    City = "Самоков"
                },

                new School {
                    Id = 626,
                    Name ="Профилирана Гимназия \"Константин Фотинов\"",
                    NormalizedName = "профилирана гимназия \"константин фотинов\"",
                    City = "Самоков"
                },

                new School {
                    Id = 627,
                    Name ="Професионална Техническа Гимназия \"Никола Й. Вапцаров\"",
                    NormalizedName = "професионална техническа гимназия \"никола й. вапцаров\"",
                    City = "Самоков"
                },

                new School {
                    Id = 628,
                    Name ="Средно Общообразователно Училище \"Отец Паисий\"",
                    NormalizedName = "средно общообразователно училище \"отец паисий\"",
                    City = "Самоков"
                },

                new School {
                    Id = 629,
                    Name ="Професионална Гимназия по Горско Стопанство \"Христо Ботев\"",
                    NormalizedName = "професионална гимназия по горско стопанство \"христо ботев\"",
                    City = "Велинград"
                },

                new School {
                    Id = 630,
                    Name ="Средно Общообразователно Училище \"Васил Левски\"",
                    NormalizedName = "средно общообразователно училище \"васил левски\"",
                    City = "Велинград"
                },

                new School {
                    Id = 631,
                    Name ="Средно Общообразователно Училище \"Св. Св. Кирил и Методий\"",
                    NormalizedName = "средно общообразователно училище \"св. св. кирил и методий\"",
                    City = "Велинград"
                },

                new School {
                    Id = 632,
                    Name ="Професионална Гимназия по Дървообработване \"Иван Вазов\"",
                    NormalizedName = "професионална гимназия по дървообработване \"иван вазов\"",
                    City = "Велинград"
                },

                new School {
                    Id = 633,
                    Name ="Професионална Гимназия по Икономика и Туризъм \"Алеко Константинов\"",
                    NormalizedName = "професионална гимназия по икономика и туризъм \"алеко константинов\"",
                    City = "Велинград"
                },

                new School {
                    Id = 634,
                    Name ="Професионална Гимназия \"Братя Евлогий и Христо Георгиеви\"",
                    NormalizedName = "професионална гимназия \"братя евлогий и христо георгиеви\"",
                    City = "Карлово"
                },

                new School {
                    Id = 635,
                    Name ="Професионална Гимназия по Железопътен Транспорт \"Христо Смирненски\"",
                    NormalizedName = "професионална гимназия по железопътен транспорт \"христо смирненски\"",
                    City = "Карлово"
                },

                new School {
                    Id = 636,
                    Name ="Средно Общообразователно Училище \"Васил Левски\"",
                    NormalizedName = "средно общообразователно училище \"васил левски\"",
                    City = "Карлово"
                },

                new School {
                    Id = 637,
                    Name ="Средно Общообразователно Училище \"Христо Проданов\"",
                    NormalizedName = "средно общообразователно училище \"христо проданов\"",
                    City = "Карлово"
                },

                new School {
                    Id = 638,
                    Name ="Средно Общообразователно Училище \"Христо Ботев\"",
                    NormalizedName = "средно общообразователно училище \"христо ботев\"",
                    City = "Нова Загора"
                },

                new School {
                    Id = 639,
                    Name =" Средно Общообразователно Училище \"Иван Вазов\"",
                    NormalizedName = " средно общообразователно училище \"иван вазов\"",
                    City = "Нова Загора"
                },

                new School {
                    Id = 640,
                    Name ="Професионална Гимназия по Селско Стопанство",
                    NormalizedName = "професионална гимназия по селско стопанство",
                    City = "Нова Загора"
                },

                new School {
                    Id = 641,
                    Name ="Професионална Гимназия по Техника и Технологии \"Атанас Димитров\"",
                    NormalizedName = "професионална гимназия по техника и технологии \"атанас димитров\"",
                    City = "Нова Загора"
                },

                new School {
                    Id = 642,
                    Name ="Средно Общообразователноучилище \"Васил Левски\"",
                    NormalizedName = "средно общообразователноучилище \"васил левски\"",
                    City = "Троян"
                },

                new School {
                    Id = 643,
                    Name ="Средно Общообразователно Училище \"Свети Климент Охридски\"",
                    NormalizedName = "средно общообразователно училище \"свети климент охридски\"",
                    City = "Троян"
                },

                new School {
                    Id = 644,
                    Name ="Професионална Гимназия по Механоелектротехника",
                    NormalizedName = "професионална гимназия по механоелектротехника",
                    City = "Троян"
                },

                new School {
                    Id = 645,
                    Name ="Природо-Математическа Гимназия \"Акад. Проф. Д-р Асен Златаров\"",
                    NormalizedName = "природо-математическа гимназия \"акад. проф. д-р асен златаров\"",
                    City = "Ботевград"
                },

                new School {
                    Id = 646,
                    Name ="Професионална Гимназия по Техника и Мениджмънт \"Христо Ботев\"",
                    NormalizedName = "професионална гимназия по техника и мениджмънт \"христо ботев\"",
                    City = "Ботевград"
                },

                new School {
                    Id = 647,
                    Name ="Техническа Професионална Гимназия \"Стамен Панчев\"",
                    NormalizedName = "техническа професионална гимназия \"стамен панчев\"",
                    City = "Ботевград"
                },

                new School {
                    Id = 648,
                    Name ="Средно Общообразователно Училище \"Свети Климент Охридски\" (Град Пещера)",
                    NormalizedName = "средно общообразователно училище \"свети климент охридски\" (град пещера)",
                    City = "Пещера"
                },

                new School {
                    Id = 649,
                    Name ="Професионална Гимназия по Хранително Вкусови Технологии \"Атанас Ченгелев\"",
                    NormalizedName = "професионална гимназия по хранително вкусови технологии \"атанас ченгелев\"",
                    City = "Пещера"
                },

                new School {
                    Id = 650,
                    Name ="Професионална Гимназия по Лека Промишленост и Машиностроене \"Васил Левски\"",
                    NormalizedName = "професионална гимназия по лека промишленост и машиностроене \"васил левски\"",
                    City = "Пещера"
                },

                new School {
                    Id = 651,
                    Name ="Професионална Гимназия по Електропромишленост и Текстил \"Захари Стоянов\"",
                    NormalizedName = "професионална гимназия по електропромишленост и текстил \"захари стоянов\"",
                    City = "Харманли"
                },

                new School {
                    Id = 652,
                    Name ="Средно Общообразователно Училище \"Неофит Рилски\"",
                    NormalizedName = "средно общообразователно училище \"неофит рилски\"",
                    City = "Харманли"
                },

                new School {
                    Id = 653,
                    Name ="Средно Общообразователно Училище \"Св. Св. Кирил и Методий\"",
                    NormalizedName = "средно общообразователно училище \"св. св. кирил и методий\"",
                    City = "Карнобат"
                },

                new School {
                    Id = 654,
                    Name ="Средно Общообразователно Училище \"Христо Ботев\"",
                    NormalizedName = "средно общообразователно училище \"христо ботев\"",
                    City = "Карнобат"
                },

                new School {
                    Id = 655,
                    Name ="Професионална Гимназия по Селско Стопанство",
                    NormalizedName = "професионална гимназия по селско стопанство",
                    City = "Карнобат"
                },

                new School {
                    Id = 656,
                    Name ="Професионална Гимназия по Облекло",
                    NormalizedName = "професионална гимназия по облекло",
                    City = "Карнобат"
                },

                new School {
                    Id = 657,
                    Name ="Средно Общообразователно Училище \"Д-р Петър Берон\"",
                    NormalizedName = "средно общообразователно училище \"д-р петър берон\"",
                    City = "Свиленград"
                },

                new School {
                    Id = 658,
                    Name ="Професионална Гимназия по Селско Стопанство и Икономика \"Христо Ботев\"",
                    NormalizedName = "професионална гимназия по селско стопанство и икономика \"христо ботев\"",
                    City = "Свиленград"
                },

                new School {
                    Id = 659,
                    Name ="Професионална Гимназия по Техника и Строителство \"Арх.Йордан Миланов\"",
                    NormalizedName = "професионална гимназия по техника и строителство \"арх.йордан миланов\"",
                    City = "Перник"
                },

                new School {
                    Id = 660,
                    Name ="Професионална Техническа Гимназия \"Иван Райнов\"",
                    NormalizedName = "професионална техническа гимназия \"иван райнов\"",
                    City = "Ямбол"
                },

                new School {
                    Id = 661,
                    Name ="Професионална Гимназия по Селско Стопанство \"Свети Климент Охридски\"",
                    NormalizedName = "професионална гимназия по селско стопанство \"свети климент охридски\"",
                    City = "Кюстендил"
                },
            });
        }
    }
}
